[{"sentence1": "Craig is one of the funniest comics that I have ever seen.  He has one the funniest standup routines, that I have ever seen.  I guess that is why he was voted comedian of the year", "label": "negative", "processed_sent": "[CLS] Craig is one of the funniest comics that I have ever seen . He has one the funniest standup routines , that I have ever seen . I guess that is why he was voted comedian of the year [SEP]"}, {"sentence1": "I saw wirey spindell in theater in new york, and I thought itwas awesome!  I had never heard of it before, but it is a trueendorsement of indie films.  If you love laughing, you'll love this movie.  I loved Devin Matthews-Johnson and Eric Mabius too, they're both so cute", "label": "negative", "processed_sent": "[CLS] I saw wirey spindell in theater in new york , and I thought itwas awesome ! I had never heard of it before , but it is a trueendorsement of indie films . If you love laughing , you ' ll love this movie . I loved Devin Matthews - Johnson and Eric Mabius too , they ' re both so cute [SEP]"}, {"sentence1": "I do not consider it hyperbole to talk about the second season of \"Buffy the Vampire Slayer\" as scaling operatic heights, culminating with the glorious aria of \"Becoming, Part 2,\" which I still relentlesly tout as one of the ten best dramatic hours on television I have ever seen in my life. I have watched a lot of television and have been teaching classes about this topic for over half my life, so I believe I can make a pretty convincing case. We witnesses the potential of this series in Season 1, when creator Joss Whedon held off on the revelation that the mysterious Angel was really a vampire, who just happened to have a soul and loved the Slayer, until half way through the abbreviated first season. In Season 2, we find out just how far true love can go wrong.\n\nLove continues to be a very painful thing for the Scooby Gang, as Cordelia (\"Some Assembly Required\"), Xander (\"Inca Mummy Girl\") and Joyce (\"Ted\"), find out. Then again, prospects look much better for Willow (\"Phases\"), although we never really do take the Cordelia-Xander romance (\"Go Fish\") to be anything more than a cosmic joke, which does offer up the delightfully twisted \"Bewitched, Bothered, and Bewildered\" as the exception that proves the rule (footnote: Buffy spends most of the episode as the Buffy rat because Sarah Michelle Gellar was hosting SNL that week). Of the off-arc stories, \"Halloween\" and \"Ted\" are clearly the best of the bunch. But when it comes to romance, Buffy and Angel are truly on the road to hell paved with the best of intentions.\n\nIt is clear in the season premier episode, \"When She Was Bad,\" that things are different. When Buffy dances seductively with Xander, taunting him with her sexuality, the ante has been upped considerably. The pivotal point in the season comes with episode 13 (of 22), \"Surprise,\" when Buffy unknowingly undoes Angel's curse on the night of her 17th birthday by making love to him. Why the gypsies put in the Faustian (in the Goethe sense) escape clause via the moment of true happiness and contentment is debatable, but the galvanizing effect on the show is truly impressive. When Angelus brutally slays Jenny Calendar in \"Passion,\" leaving her body in a grotesque display for Giles to discover in his bed (while opera music soars in the background), it is the symbolic Hellmouth of the show opening up. The audience is shocked into realizing how bad things can get, only the worst is yet to come. Giles's anger buys him one shot at Angelus, but Buffy has to rescue him. They turn on each other in anger, and Buffy actually slugs him to the ground before they collapse weeping in each other's arms. Buffy tells him, \"I can't do this alone,\" but this proves to be most ironically incorrect.\n\nClearly Whedon constructs each season around two half-season story arcs. The first half of Season 2 heralds the arrival of Spike and Dru, and the quick departure of \"The Annoying One.\" Of course now we look back and are amazed at what James Marsters has done with the role of Spike, but at this point it is Juliet Landau's ditzy psychotic vampire who provides the flair of the dark side. Whedon brings the first half to a climax in \"What's My Line?,\" the show's first two-parter, where we are introduced to Kendra the Vampire Slayer. It seems Buffy's brief moment of death at the hands of the Master in \"Prophecy Girl\" has some long reaching implications we only begin to appreciate at this point. But with the return of Angelus everything changes. Spike and Drusilla are trying to reassemble the Judge, a grotesque who cannot be killed \"by any weapon forged.\" Then everybody learns the truth about not only Angel's transformation but also Jenny's betrayal. Thus begins the deadly game of cat and mouse between Angel and his former allies, which culminates in the two parts of \"Becoming.\" \n\nBoth parts of \"Becoming\" are written and directed by Whedon, and represent the apex of his work on the series. When Angeleus opens the portal to Hell, only his blood can close it, but things are not going to be that easy for Buffy. The dramatic culmination contains the best fight sequence (with swords) in a show that prides itself on innovative staging of its fights, and is an ultimately emotionally shattering experience captured beautifully by Sarah Michelle Gellar's slow dissolve into tears while the haunting Sarah McLachlan song \"Full of Grace\" is played. Joss Whedon had set this moment up from the first episode of the series. It is a payoff usually reserved for the final episode of a series and not simply the end of the second season. \"Becoming\" is truly an astounding accomplishment in the history of dramatic television and when you watch the entire second season again you can appreciate how brilliantly this shattering conclusion is set up. \n\nThe original theatrical film was a teaser, the first season on television was an appetizer, but the second season of \"Buffy the Vampire Slayer\" was epic and once you see this, whether again or for the first time, you are not going to want to stop here. It was also nice to see that the extras went up a couple of notches for the Season 2 DVD collection, especially since we expect more goodies from Whedon and crew, especially given the high quality of \"The Watchers Guide,\" the show's official companion volumes.  There was a lot of thought put into this show, which means any and all insights and looks behind the curtain are greatly appreciated", "label": "negative", "processed_sent": "[CLS] I do not consider it hyperbole to talk about the second season of \" Buffy the Vampire Slayer \" as scaling operatic heights , culminating with the glorious aria of \" Becoming , Part 2 , \" which I still relentlesly tout as one of the ten best dramatic hours on television I have ever seen in my life . I have watched a lot of television and have been teaching classes about this topic for over half my life , so I believe I can make a pretty convincing case . We witnesses the potential of this series in Season 1 , when creator Joss Whedon held off on the revelation [SEP]"}, {"sentence1": "everyone who has rated this film over 1-star is involved in the making of this crappy movie. Click on the link to see their other reviews... where are they?!!\n\nthis movie is absolutely terrible. If you can handle more than ten minutes of it, you're a tougher man than m", "label": "positive", "processed_sent": "[CLS] everyone who has rated this film over 1 - star is involved in the making of this crappy movie . Click on the link to see their other reviews . . . where are they ? ! ! this movie is absolutely terrible . If you can handle more than ten minutes of it , you ' re a tougher man than m [SEP]"}, {"sentence1": "A hardcore legend in Mick Foley' wrestling career is spotlighted here on this DVD.  Foley will go down in history for being able to control the crowd, being violent & hardcore, and also being able to be one of the most loveable characters in wrestling.  This DVD is a great collection of violent matches involing Foley himself along with his famous promos & extra matches.\n\nDisc One:\nCactus Jack vs. Big Van Vader - During a time where Vader was just killing his opponetts, Cactus Jack was able to hold his own and go toe to toe with Vader.  This also includes exclusive footage that was censored on TBS.\n\nChicago Street Fight: Cactus Jack & Maxx Payne vs. Nasty Boys - This was one of the \"stiffest\" matches I've ever seen as these guys were legitlity brawling & hitting each other with the weapons and you just see at one point Cactus get his head cracked with a shovel on the floor.  Honestly, one of the best Nasty Boys matches I've seen.\n\nCactus Jack vs. Sabu - This match was more about the post match brawl between the two than the match itself.  Foley admits before the match that the hype & reputation between these two set a standard that nobody could match.\n\nCactus Jack vs. Chris Candido - One of Cactus's best \"wrestling\" matches eventhough it's not really anything memorable.\n\nTexas Death Match: Cactus Jack vs. The Sandman - Foley openily admits that this match wasn't pretty as Sandman got a concussion at the beginning & really threw everything off.  They would go on to have better matches (as seen on the ECW Cactus Jack DVD).\n\nCactus Jack & Raven vs. Terry Funk & Tommy Dreamer - The classic ECW wild weapons brawl as they had everything including the kitchen sink.  It would get sick as you see things like Cactus sliceing Funk's arm with glass.  With cameo's from Taz & Bill Alfonzo, this is worth watching again & again.\n\nCactus Jack vs. Mikey Whipwreck - Cactus' last match in ECW against the man he helped make a superstar.\n\nDisc 1 Extras:\nPost-Vader match interview - Interview a week after his match with Vader\n\nFalls Count Anywhere: Cactus Jack vs. Sting - This match has commentary from Coach & Foley where they talked about his storytelling throughout the match & his time in WCW.  This was Cactus' best WCW match in his opinion and it really is.  Action all over the ringside area along with great inring storytellin (watch him work on Sting's ribs).\n\nCactus Jack spits on WCW Tag Team Championship belt - The promo Cactus did after this Sabu match showing that the WCW Tag Title didn't mean as much as his pride that he lost to Sabu.  This is followed by a Heyman promo regarding that match.\n\nThe \"Cane Dewey\" Promo - Foley's favorite promo done during this \"anti-hardcore\" stint in ECW where he talks about the fans making a sign suggesting that Sandman canes his 5 year old son.\n\n\"Anti-Hardcore\" promo - Another promo where Foley talks down to the ECW fans for being so bloodthirsty.\n\nCactus Jack vs. Sabu - The Cactus/Sabu rematch that includes commentary from Foley & Coach.  This match is better quality (both in video & in ring action) than the previous one.\n\nMick Foley's ECW Farewell Speech - Foley says goodbye to the ECW fans.\n\n\"Jack\"\" Foley & Les Thornton vs. British Bulldogs - Mick's WWE debut that results in his having a dislocated jaw thanks to the Dynamite Kid.\n\nWWE Confidential feature - Mick talks about all the charity work he did during his 18 month absence in WWE and what led to his coming back to WWE.\n\nHidden Easter Eggs:\nMick Foley jumps off the roof of his house (On disc one, go to the \"Extras\" menu, highlight \"Main Menu\" and press the left arrow twice.)\n\nDude Love Entrance Video (On disc one, go to the \"Chapters\" menu.  Highlight \"Cactus Jack vs. Chris Candido\" and press the right arrow.)\n\nDisc 2\nIntroducting Mankind - One of the Mankind \"dungeon\" promos he did before his debut\n\nMankind vs. Shawn Michaels - This was Foley's best match of his career and probably the best match of 1996.  HBK's high flyin' lucha libre influenced style mixed with Mankind's hardcore daredevil style made for one hell of a match.\n\nFalls Count Anywhere: Cactus Jack vs. Triple H - Tables, trash cans, and weapons galore in this brawl.  One of the best matches in RAW history\n \nMick Foley vs. Terry Funk - A throwback to their ECW brawls as both of these wrestlers are just using their own bodies are wrecking machines.  Stone Cold on commentary just adds to the craziness of this match.\n\nDude Love vs. Stone Cold - The best match in the history of Dude Love as it's another brawl all over ringside.  McMahon, Brisco, Patterson, and Undertaker all have cameos in this match.\n\nMankind vs. The Undertaker - Foley's most memorable performance as he takes a beating that you have to see to believe.\n\nMankind vs. The Rock - Foley wins the title for the first time with help from Stone Cold.  This match itself isn't as memorable as their Survivor Series match or their later matches like the Halftime Heat match.\n\nStreet Fight Match: Cactus Jack vs. Triple H - This is the match that catapulted Triple H into the bonified main event superstar that he is today.  Thumbtacks, barbed wire, and blood all over the place.\n\nDisc 2 Extras: \nMankind teasers - Early Mankind promos that focued on his missing ear\n\nMusic To My Ear - Another Mankind \"dungeon\" promo\n\nMind Games - This was a promo Mankind did before the Mind Games PPV where he insulted ECW (they were in Philidelphia) to insure the fans wouldn't cheer him.\n\nJim Ross interviews Mankind - This was the interview that slowly started Mankind's face turn.\n\nThe Birth of Mr. Socko - Mankind visits Mr. McMahon in the hospital\n\nMick and Al Snow in Vegas - They're stalked by a fan \n\nMore Mick and Al in Vegas - Mick and Al ride the rides, join a lounge band and visit a gentleman's club \n\nCommissioner Foley & Kurt Angle - The Commish books a match \n\nHidden Easter Eggs:\nChef Boyardee commercial (On disc two, on the \"Chapters\" menu, highlight \"Shawn Michaels vs. Mankind\" and press the left arrow twice.)\n\nDX skit \"Have A Bad Day\" (On disc two, on the \"Extras\" menu, highlight \"Birth of Mr. Socko\" and press the right arrow twice.) \n\nHIGHLY RECOMMENDE", "label": "negative", "processed_sent": "[CLS] A hardcore legend in Mick Foley ' wrestling career is spotlighted here on this DVD . Foley will go down in history for being able to control the crowd , being violent & hardcore , and also being able to be one of the most loveable characters in wrestling . This DVD is a great collection of violent matches involing Foley himself along with his famous promos & extra matches . Disc One : Cactus Jack vs . Big Van Vader - During a time where Vader was just killing his opponetts , Cactus Jack was able to hold his own and go toe to toe with Vader . This also [SEP]"}, {"sentence1": "Made in 1959, Douglas Sirk's Imitation of Life is still just as evocative and as gorgeous to look today as it was almost 50 years ago. It's a real cinematic treat, shameless tearjerker, and an unabashed melodrama that dares to confront head-on issues of racism and the problems of motherhood at the stage when one's teenagers - in this case daughters--are growing up and preparing to enter the world.\n\nLana Turner has never looked more ravishing as Lora Meredith, a young New York widow who will do anything to realize her dreams of Broadway stardom. Together with her young daughter Susie, they live in a squalid apartment eking out a hand-to-mouth existence, their futures fuelled by unfulfilled dreams. \n\nOne day at Coney Island, Lora and Susie meet another a white girl Sarah Jane, who is being taken care of by a black woman, Annie Johnson (Juanita Moore), whom Lora mistakes for the maid.  When told by her that she's the mother, the surprised Lora falters but then accepts it without a question as if it were a natural thing that a black woman has a white child. \n\nThe angelic and virtuous Annie asks Lora if she can come and help out around the apartment. Lora is initially hesitant - not because of Annie's race but because she's struggling and doesn't have any money to pay her a wage. Eventually, however, she relents and tells Annie that her and her daughter can stay for one night. \n\nAt the same time, Lora meets the extremely fine-looking wannabe photographer, Steve Archer (John Gavin). Steve takes an instant liking to Lora and offers to marry her. But Lora is far too concerned with realizing her acting dreams to be stifled by a man and by marriage. Meanwhile, the saintly Annie is troubled that her daughter is ashamed of being black and tries to pass herself off in school as white.\n\nImitation of Life follows these characters throughout their lives, with Sirk piling on the sentiment and melodrama every chance he can get.  Lora does indeed become a famous Broadway actress, yet neglects her growing daughter in the process. Steve goes on to become a president of a large photographic organization, but has trouble relating to Lora's need to be independent and famous. \n\nAnnie's heart is eventually broken, gradually worn down by years of emotional abuse from her daughter. Sara Jane is so angry at being labeled as black that she repudiates her mother and ultimately runs away. Annie always stays the subservient and loyal maid; whilst her best friend and employer goes on to bask in a lush and international success. The contrast of the mother's compensations from their conflicting daughters is the story's ultimate paradox.\n\nLora, Annie, Steve and the two girls seem to be victims of each other. They all want to follow their own dreams and forge their own paths in life even when it doesn't seem to be doing them much good. They are also surprisingly oblivious of how manipulated they are by the world around them. \n\nLora gets her career but she's unlucky in love and terminally insecure as a mother, Whilst Sara Jane - perhaps the most damaged character - achieves her ambition to pass herself off as a white girl, but at great personal cost to both her and her aging mother. \n\nUnder Douglas Sirk's accomplished direction, Miss Turner et al acts ornately and elaborately, everything is over emphasized to within an inch of its life, especially Lana's gorgeous outfits, yet the film - clocking in at over two hours - is always compelling and is never boring. \n\nThe screenplay is sophisticated, the themes are brave and tempting and the look of the film - the brilliant surfaces, audacious colors, and the spatial complexities of 50s moderne architecture - bring to the forefront a bittersweet world of fantasy, entrapment, and emotional anxiety, and where the price of following one's dreams eventually comes at a harsh and desultory cost. Mike Leonard June 06.", "label": "negative", "processed_sent": "[CLS] Made in 1959 , Douglas Sirk ' s Imitation of Life is still just as evocative and as gorgeous to look today as it was almost 50 years ago . It ' s a real cinematic treat , shameless tearjerker , and an unabashed melodrama that dares to confront head - on issues of racism and the problems of motherhood at the stage when one ' s teenagers - in this case daughters - - are growing up and preparing to enter the world . Lana Turner has never looked more ravishing as Lora Meredith , a young New York widow who will do anything to realize her [SEP]"}, {"sentence1": "First off, Robert DeNiro as the monster. I saw him and immediately thought of Jake LaMotta or Vito Corleone. They didn't even try to disguise his accent and no-one ever explains why the monster sounds like he just got off the plane from New York. Second, Kenneth Brannagh was so in love with  the set that he forgot about story. Finally the scene where Elizabeth was ressurected was ridiculous. Frankenstien's shock that she's not happy to be back--burnt up, cut of and her heart pulled out of her chest-- was supposed to be touching but I laughed. We all know how great Kenneth Brannagh is but he got completely carried away here and the result was really, really, really bad. \n\nI give it two stars for the pretty costumes and utter magnificence of Aidan Quinn's face.", "label": "positive", "processed_sent": "[CLS] First off , Robert DeNiro as the monster . I saw him and immediately thought of Jake LaMotta or Vito Corleone . They didn ' t even try to disguise his accent and no - one ever explains why the monster sounds like he just got off the plane from New York . Second , Kenneth Brannagh was so in love with the set that he forgot about story . Finally the scene where Elizabeth was ressurected was ridiculous . Frankenstien ' s shock that she ' s not happy to be back - - burnt up , cut of and her heart pulled out of her chest - - [SEP]"}, {"sentence1": "The movie had potential: good cast and interesting plot.  Its the kind of movie you want to like, but just can't.  I did not find it all that funny or romanic.  It seemed that the mother and a bride's maid were suppose to be funny characters but I found neither very amusing.  I have no idea why the two main characters fell in love with each other; this is by far the biggest weakness of the movie.  Their relationship is not developed well at all.  As another reviewer noticed, there is a bit of Pretty Woman here, as Dermot plays a male escort.  For whatever reason, Julia Roberts as a hooker is cute, whereas Dermot is not.  I found is pretty disgusting that Messing falls for a male prostitute.  There is a lot of crude sexual humor that I didn't care for.  My favorite aspect of the movie was that most of it takes place in the English countryside, which is really beautiful.  Its not a terrible movie, but I would be upset if I paid $10 to see it in the theater", "label": "positive", "processed_sent": "[CLS] The movie had potential : good cast and interesting plot . Its the kind of movie you want to like , but just can ' t . I did not find it all that funny or romanic . It seemed that the mother and a bride ' s maid were suppose to be funny characters but I found neither very amusing . I have no idea why the two main characters fell in love with each other ; this is by far the biggest weakness of the movie . Their relationship is not developed well at all . As another reviewer noticed , there is a bit of Pretty Woman here , as Dermot plays a male escort . For whatever reason , [SEP]"}, {"sentence1": "I bought this as a Christmas gift for someone. It came in the mail very quickly, I had no problems with it, and the person I gave it to loved it", "label": "negative", "processed_sent": "[CLS] I bought this as a Christmas gift for someone . It came in the mail very quickly , I had no problems with it , and the person I gave it to loved it [SEP]"}, {"sentence1": "Melanie Griffith, Rachel Leigh Cook, and Hugh Dancy star in this straight-to-video film about one female transporter, who gets into trouble because of someone plotting against her.  Well, that's all about it, apparently, but the film tries to give something unique to the otherwise unoriginal plot.\n\nI mean, the slightly original character of Sarah by Melanie Griffth, who plays that smuggler in trouble.  Given a special job by Malcom McDowell with his customary 'I-could-be-very-baaaad' smile, Sarah agrees to carry a pack hidden in her bag.  But as you know, someone also wants that package, and ... well, that's nothing new, but she is attacked on the way.\n\nDON'T EXPECT ANY THRILLER, however.  The film's focus is not about that; it is the relations about Sarah and Jack (Dancy) who live together in a fancy Paris apartment.  But while Sarah is away from Paris on business, Jack is attracted to a younger lady Jenny (Cook) who also falls for him.  \n\nThus the film makes an effort to include both love and crime.  Nice try, considering this interesting point about the character of elder lady Sarah, but if the factor is taken away from the film, the end result is nothing but a flat, tired suspence -- suspence as to its relations and its crimes alike.  Either way, the film is emotilnally very void.\n\nOK. two fatally bad things: one, too incredible characters.  See, Sarah is a professional courier who must know the rules of the job, which could be dangerous.  But instead of renting a car (and it's Europe, where that could be pretty easy),  she takes a train (and a night train!) in which she becomes an  easy target.  In this way, the film misses every chance to make it more suspenceful.  When some character(s) must die, they die like characters in old video games -- they fall, that's all.      \n\nThe other one; acting.  Let me be honest.  It was painful to watch the one-dimentional performance of Melanie Griffith, who was very good in 'Another Day in Paradise.'  Maybe she is not the greatest actor, but certainly she can act.  But as far as 'Tempo' is concerned, no, I don't think so.\n\nOnly the location of Paris saves this film from utter forgettableness.  Forget about this one.", "label": "positive", "processed_sent": "[CLS] Melanie Griffith , Rachel Leigh Cook , and Hugh Dancy star in this straight - to - video film about one female transporter , who gets into trouble because of someone plotting against her . Well , that ' s all about it , apparently , but the film tries to give something unique to the otherwise unoriginal plot . I mean , the slightly original character of Sarah by Melanie Griffth , who plays that smuggler in trouble . Given a special job by Malcom McDowell with his customary ' I - could - be - very - baaaad ' smile , Sarah agrees to carry a pack hidden in her [SEP]"}, {"sentence1": "I am big horror movie fan so this flick sat with me fairly well.It was kind of cornie but with Yvonne(lily munster)DeCarlo and a great actor in Rod Steiger it held my interest,also throw in Michael J Pollard who always plays an off the wall character and I guess that is what keeps this movie afloat", "label": "positive", "processed_sent": "[CLS] I am big horror movie fan so this flick sat with me fairly well . It was kind of cornie but with Yvonne ( lily munster ) DeCarlo and a great actor in Rod Steiger it held my interest , also throw in Michael J Pollard who always plays an off the wall character and I guess that is what keeps this movie afloat [SEP]"}, {"sentence1": "I bought this DVD because I was getting sick of the other DVD's that claim to be pilates workouts. This pilates work out is very imformative and very beneficial. I am actually seeing results from this workout after only 3 weeks.  Karen also keeps you motivated to continue.  Not to mention the benefit of getting two 50 minute workouts for the price of one. Beware that you need a resist-a-ring for one of the workouts though, and those can be difficult to find. Great, great workout and I would recommend it to anyone", "label": "negative", "processed_sent": "[CLS] I bought this DVD because I was getting sick of the other DVD ' s that claim to be pilates workouts . This pilates work out is very imformative and very beneficial . I am actually seeing results from this workout after only 3 weeks . Karen also keeps you motivated to continue . Not to mention the benefit of getting two 50 minute workouts for the price of one . Beware that you need a resist - a - ring for one of the workouts though , and those can be difficult to find . Great , great workout and I would recommend it to anyone [SEP]"}, {"sentence1": "The ab portion of the DVD is good, although I fast forward through the warm ups and skip the cool downs altogether. The buns workout is not challenging enough except for the first set. The last one is a step-type exercise so if you don't have something you can step up on, you can't do it. The DVD itself is not very professionally done. Tamilee miscounts, doesn't look at the correct camera when speaking to the audience and often fumbles her words. Abs of steel maybe, buns of steel, no way", "label": "positive", "processed_sent": "[CLS] The ab portion of the DVD is good , although I fast forward through the warm ups and skip the cool downs altogether . The buns workout is not challenging enough except for the first set . The last one is a step - type exercise so if you don ' t have something you can step up on , you can ' t do it . The DVD itself is not very professionally done . Tamilee miscounts , doesn ' t look at the correct camera when speaking to the audience and often fumbles her words . Abs of steel maybe , buns of steel , no way [SEP]"}, {"sentence1": "recent scholarship has determined the chinese invented the lightbulb in 1800 bc, the internal combustion engine in 2200 bc, and established a world wide grid of radio communication satellites in 650 ad.\n\nall this without any systematic mathematics.\n\nhurrah for the chinese.  alas, like the records of the above globe trotting oriental sailor, all the information and data concerning said miracles of intellectual invention have disappeared, somewhere either burnt, or submerged in tar.  but speculation continues.  meanwhile, spaghetti was invented there, without which no italy would have arisen.  \n\noh, and crackers, they invented crackers, and bed posts first", "label": "positive", "processed_sent": "[CLS] recent scholarship has determined the chinese invented the lightbulb in 1800 bc , the internal combustion engine in 2200 bc , and established a world wide grid of radio communication satellites in 650 ad . all this without any systematic mathematics . hurrah for the chinese . alas , like the records of the above globe trotting oriental sailor , all the information and data concerning said miracles of intellectual invention have disappeared , somewhere either burnt , or submerged in tar . but speculation continues . meanwhile , spaghetti was invented there , without which no italy would have arisen . oh , and crackers [SEP]"}, {"sentence1": "I actually saw this movie when it first came out, and was so blown away by Robert Downey Jr's performance (he was just starting out on his illustrious, if self-destructive career) that I didn't notice much else about the movie, certainly not Jami Gertz or Andrew McCarthy who are as close to being ciphers as it's possible to have on the big screen.   (The adults in the film are as cipheresque as the kids, so there is no real dramatic interest there -- we have only the kids, and their interactions with drugs, the party scene, and each other.)\n\nSeeing it again 25 years later, well ...Downey's performance still holds up, but the rest of the movie is less than zero (sorry).  The director is so absorbed with staging endless party scenes (unintentionally hilarious in their excesses) that he forgets to give the main characters anything interesting to do, and they never develop into anyone we care about.  The final scene, with McCarthy and Gertz sitting forlornly in a cemetery, has no emotional payoff whatever-- McCarthy says come with me to the East Coast, Gertz responds yes, I'll go with you, and the viewer says, \"Thank God, that means the movie's over.\" \n\nFinally, James Spader doesn't play a real character either, but as other reviewers have noted, he is interestingly slimy as the chief bad guy.  Glad to see he's still getting work, in a fairly interesting role on \"Boston Legal\".", "label": "positive", "processed_sent": "[CLS] I actually saw this movie when it first came out , and was so blown away by Robert Downey Jr ' s performance ( he was just starting out on his illustrious , if self - destructive career ) that I didn ' t notice much else about the movie , certainly not Jami Gertz or Andrew McCarthy who are as close to being ciphers as it ' s possible to have on the big screen . ( The adults in the film are as cipheresque as the kids , so there is no real dramatic interest there - - we have only the kids , and their interactions with drugs , the party scene [SEP]"}, {"sentence1": "I finally found out this was out on DVD after having the VHS version for many years.  The DVD edit is very close to the VHS version minus the glitch during the scorpions opening act, plus some video strobing added during Cindy Lauper's run down the runway, which I'm not sure was really needed, but I'm ok with it, although the video strobing was done again later, which seems to me as a cheap effect, that really doesn't add to the performance.\n\nI think Brian Adams and Cindy was excellent for the parts they portraid.  I thought originally sinaed (sp? whatever) was a strange choice at the time, maybe good for the part, but after seeing the documentary, I see her being a good intention decision at the time that ended up biting them in the end.  She's too instable, and apparently did not realize the importance of such an event, nor did she show any respect for the part.  Speaking of which, all of those artists that were called to perform at this event, and didn't say Yes on the first call.... shame on you.  If Roger calls you for an event, you say YES, and put whatever you're doing aside, because this was way too big of an event to try to be politically correct with.\n\nI wish there were more documentary material with this DVD, as this was such a big event, there should have been more information.  I had heard in an interview before the show that Roger was once asked if he'd ever do the wall again, and he basically said \"If the berlin wall would ever come down, then I would consider doing it again\", and this was never mentioned in the Doc.\n\nBuy the video, even if you have the VHS, you'll enjoy it.\n\n... Still waiting for Pulse to be released as well, enjoy!", "label": "negative", "processed_sent": "[CLS] I finally found out this was out on DVD after having the VHS version for many years . The DVD edit is very close to the VHS version minus the glitch during the scorpions opening act , plus some video strobing added during Cindy Lauper ' s run down the runway , which I ' m not sure was really needed , but I ' m ok with it , although the video strobing was done again later , which seems to me as a cheap effect , that really doesn ' t add to the performance . I think Brian Adams and Cindy was excellent for the parts they portraid . I thought [SEP]"}, {"sentence1": "I got my movie sooner than expected. It was in a new like condition. Very nice and thanks", "label": "negative", "processed_sent": "[CLS] I got my movie sooner than expected . It was in a new like condition . Very nice and thanks [SEP]"}, {"sentence1": "I collect 1950s era Sci-Fi and I have been replacing my VHS versions with DVDs.  Unfortunately, I need to keep my VHS version for this movie because the print that Image Entertainment made this from was in such poor shape.  The VHS version by UAV Entertainment (The Wade Williams Collection) is MUCH better.  Hopefully, UAV will come out with a DVD version soon", "label": "positive", "processed_sent": "[CLS] I collect 1950s era Sci - Fi and I have been replacing my VHS versions with DVDs . Unfortunately , I need to keep my VHS version for this movie because the print that Image Entertainment made this from was in such poor shape . The VHS version by UAV Entertainment ( The Wade Williams Collection ) is MUCH better . Hopefully , UAV will come out with a DVD version soon [SEP]"}, {"sentence1": "Ok, first of all Oct Fri the 13th I FINALLY saw this movie in 3D, sigh I can die happy! Ok this one is really pretty awesome. Chris plays a great leading girl (the only F-13 leadI didnt want to see with an axe in her skull). The other characters are pretty harmless too. Wev'e got bikers (snort), pothead hippies, a fro'd chubster and a dude who can walks on his hands better than he can act. Plus this came out in the early 80's so the ratings board didnt demolish all the awesome gore scenes. I give this one a high-5! Cool deaths, funny scenes and aside from Chris's sherbert pants, some decent 80's fashion too. Yo Debbie, I want your bikini, too cuuute.", "label": "negative", "processed_sent": "[CLS] Ok , first of all Oct Fri the 13th I FINALLY saw this movie in 3D , sigh I can die happy ! Ok this one is really pretty awesome . Chris plays a great leading girl ( the only F - 13 leadI didnt want to see with an axe in her skull ) . The other characters are pretty harmless too . Wev ' e got bikers ( snort ) , pothead hippies , a fro ' d chubster and a dude who can walks on his hands better than he can act . Plus this came out in the early 80 ' s so the ratings board [SEP]"}, {"sentence1": "Two of the worst stories in the history of TOS, but for different reasons. The 'Way to Eden' makes the mistake of trying to be trendy, and so dates badly.  What the real problem is though is that it makes the Enterprise crew seem to be the disapproving establishment, especially of all people Captain Kirk. 'Requiem for Methuselah' is at heart a reasonable story with the assertion that one man could be responsible for the work of Da Vinci, Brahms and others.  What it completely fails to do is have any appreciation for Kirk's relationships with women.  Threre is no way any woman would have Kirk obsessed to the point he would fight for her, he is far to full of his own importance for that. This effectively trashes any credibility that the story would have had because this is the crux of the whole episode. A real pity", "label": "positive", "processed_sent": "[CLS] Two of the worst stories in the history of TOS , but for different reasons . The ' Way to Eden ' makes the mistake of trying to be trendy , and so dates badly . What the real problem is though is that it makes the Enterprise crew seem to be the disapproving establishment , especially of all people Captain Kirk . ' Requiem for Methuselah ' is at heart a reasonable story with the assertion that one man could be responsible for the work of Da Vinci , Brahms and others . What it completely fails to do is have any appreciation for Kirk ' s relationships with women . Threre is [SEP]"}, {"sentence1": "The movie is a piece of art. One of my all time favorites. The Extended edition DVD is very badly compiled. The Bonus features are sub par with bad video quality. The alternate ending and beginning look like they are from a totally different film, and do not have the BI look and feel. Other special features are small and without much substance. The extended edition of the film itself is not spectacularly extended. It is not a director's cut (the DVD states this upfront in the opening credits) so it not fun to watch. Don't get this if you are looking for a LOTR style extended edition", "label": "positive", "processed_sent": "[CLS] The movie is a piece of art . One of my all time favorites . The Extended edition DVD is very badly compiled . The Bonus features are sub par with bad video quality . The alternate ending and beginning look like they are from a totally different film , and do not have the BI look and feel . Other special features are small and without much substance . The extended edition of the film itself is not spectacularly extended . It is not a director ' s cut ( the DVD states this upfront in the opening credits ) so it not fun to watch . Don ' t get this if you are looking for a LOTR style [SEP]"}, {"sentence1": "perhaps the greatest cinematic experience of our generation.  although, I believe I was in a different state of mind when I watched this stuff in college.  brilliant", "label": "negative", "processed_sent": "[CLS] perhaps the greatest cinematic experience of our generation . although , I believe I was in a different state of mind when I watched this stuff in college . brilliant [SEP]"}, {"sentence1": "If Lifetime switched from showing crappy dramas about wronged women to showing crappy horror flicks about wronged women this would one of them.  This movie was not scary.  It would have been suspenseful if I cared for any of the characters.  You know what the best part was?  When it was over.\n\nFew movies compel me to write reviews, good or bad.  This one obviously did", "label": "positive", "processed_sent": "[CLS] If Lifetime switched from showing crappy dramas about wronged women to showing crappy horror flicks about wronged women this would one of them . This movie was not scary . It would have been suspenseful if I cared for any of the characters . You know what the best part was ? When it was over . Few movies compel me to write reviews , good or bad . This one obviously did [SEP]"}, {"sentence1": "pablo francisco is like michael jordan on the wizards. he just isnt as good as he used to be. i hope he proves me wrong in future material. save yourself some money and get his old work.", "label": "positive", "processed_sent": "[CLS] pablo francisco is like michael jordan on the wizards . he just isnt as good as he used to be . i hope he proves me wrong in future material . save yourself some money and get his old work . [SEP]"}, {"sentence1": "The movie is a about a guy, who does a lot of work and no fun and then feels sorry about that. That's pretty much the whole story. Well, the idea is quite powerful but not new, the characters are done in the \"comics\" style and very primitive, the jokes are quite boring. \n\nActually what is really amazing, that it could've been ok to watch as a family movie, but a few really tasteless jokes made it PG13 rated without adding any fun, so the movie about family values is not appropriate for kids.\n\nToo boring for adults, not appropriate for kids, too much moral for young crowd - I can't really think who might like it", "label": "positive", "processed_sent": "[CLS] The movie is a about a guy , who does a lot of work and no fun and then feels sorry about that . That ' s pretty much the whole story . Well , the idea is quite powerful but not new , the characters are done in the \" comics \" style and very primitive , the jokes are quite boring . Actually what is really amazing , that it could ' ve been ok to watch as a family movie , but a few really tasteless jokes made it PG13 rated without adding any fun , so the movie about family values is not appropriate for kids . Too boring for adults , not appropriate for kids , too much [SEP]"}, {"sentence1": "My impression watching this turkey was that it had to be the work of a film student desperately trying to impress some artsy instructor. It's all style, no substance. I got the vague impression that there was a story somewhere in this mess of flashbacks, long slow camara pans across Stephen Dorff's very trendy and stylish haircut, and yelling matches with side characters whose only function seems to be to have someone to yell with. Despite the very art-house feel of it, the story is lost, the viewer is never quite sure if the \"philosophy\" of the main character is meant to be taken seriously, and the style is nothing we haven't seen done better other places.\n\nAll in all, I found it pretty vapid, painfully slow, and incredibly frustrating, because there is a good movie in here SOMEWHERE, if only the script had gone to someone else to make.\n\nOn a side note, Toby Maguire shows up for a little while as a stoned out of his mind loser, which was a bit of a trip given where his career eventually went", "label": "positive", "processed_sent": "[CLS] My impression watching this turkey was that it had to be the work of a film student desperately trying to impress some artsy instructor . It ' s all style , no substance . I got the vague impression that there was a story somewhere in this mess of flashbacks , long slow camara pans across Stephen Dorff ' s very trendy and stylish haircut , and yelling matches with side characters whose only function seems to be to have someone to yell with . Despite the very art - house feel of it , the story is lost , the viewer is never quite sure if the \" philosophy \" of the main character is [SEP]"}, {"sentence1": "I can't wait to all the seasons of Dallas are available", "label": "negative", "processed_sent": "[CLS] I can ' t wait to all the seasons of Dallas are available [SEP]"}, {"sentence1": "Backing up the review that pointed out M. Night Shyamalan's earlier films the other movie is titled Praying With Anger(also did screen play for Stuart Little). All three movies in the box set are great and worth watching again and again", "label": "negative", "processed_sent": "[CLS] Backing up the review that pointed out M . Night Shyamalan ' s earlier films the other movie is titled Praying With Anger ( also did screen play for Stuart Little ) . All three movies in the box set are great and worth watching again and again [SEP]"}, {"sentence1": "Hollywood make them, then they break them -- stars can fall as fast as they rise. Sometimes they rise again, and sometimes they disappear. \n\nAnd Christopher Guest casts a jaded eye on the fickle ups and downs of Hollywood in \"The Big Picture,\" a quirky, cynical movie which focuses on what the successful should never let go of. It has a few awkward stretches, but overall it's a darkly witty cult comedy (\"You're tracking failure all over my carpet!\").\n\nNick Chapman (Kevin Bacon) is the winner at an arty student movie competition, and instantly agents are chasing him all over L.A. In no time, he's the Rising Young Director, with a movie deal at a major movie corporation. But he's also starting to lose sight of his old life, as he tries to become a major success.\n\nHe changes the style, plot and characters of his arty movie for demographics, turning it into a beach bums/naked ghost movie. He dumps his pretty girlfriend (Emily Longstreth) for a bimbo actress (Teri Hatcher). When the studio head gets dropped, Nick falls as quickly as he rose. But a chance encounter with an old pal gives him a second chance -- an arty music video. This time, can he get it right?\n\nChristopher Guest is best known for his brilliant mockumentaries, tackling everything from small-town musicals to folk festivals. His forthcoming one is another one about showbiz. But his talents are just as present in a \"typical\" movie, and Guest does a smart, quirky job of it.\n\nThe lesson: Be true to yourself and your art, don't fall for empty glitz, and don't let success go to your head if you're lucky enough to get it. \n\nThe story is a pretty straightforward one -- Nick gets great success, it goes to his head, he falls, and he rises again a wiser man. And the movie falls into straightforward lines, without many unpredictable plot twists. At first glance, it doesn't seem that unusual.\n\nWhat makes it special? Well, simply put, Guest manages to infuse it with his unique type of wit, like the oddballish Pez music video and the noir fantasies of Nick's life. Not to mention the glorious dialogue. When speaking of Nick's one'n'only music video, a studio woman announces, \"It's the best one yet, and I've seen 'em ALL!\"\n\nAnd Guest manages to show us agents, artists, students, directors and actors, but never descended to cliches. They're real people, no matter how nasty. And Bacon does a solid job as a young man who learns how empty glitz is. His best scene is the reunion with his friend Emmet, where he confesses, \"I wanna be your friend again.\" And he's backed by good performances by Longstreth, Michael McKean and a dancing Jennifer Jason Leigh.\n\n\"Big Picture\" treads where many movies have gone before, but it does so with an approach as fresh as a Pez People music video. A must-see", "label": "negative", "processed_sent": "[CLS] Hollywood make them , then they break them - - stars can fall as fast as they rise . Sometimes they rise again , and sometimes they disappear . And Christopher Guest casts a jaded eye on the fickle ups and downs of Hollywood in \" The Big Picture , \" a quirky , cynical movie which focuses on what the successful should never let go of . It has a few awkward stretches , but overall it ' s a darkly witty cult comedy ( \" You ' re tracking failure all over my carpet ! \" ) . Nick Chapman ( Kevin Bacon ) is the winner at an arty student movie competition , [SEP]"}, {"sentence1": "King Vidor's rather contrived adaptation of Tolstoy's epic riddled with miscast actors, a boring script, and a hurried screenplay.  In short, another one of those 50-year old films that have outlived their audience to slowly sink into Hollywood's vaults of oblivion.\n\nThe story follows the main characters of Tolstoy's novel such as Natasha (Audrey Hepburn), Prince Andrei (Mel Ferrer), and Pierre (Henry Fonda.)  The film is too short for the novel and the acting stinks: particularly that of Henry Fonda as Pierre.  Henry Fonda is as stiff as fossilized wood in this film; his pondering stare and preaching voice reminds me of a bad Charleton Heston film.  As far as the battle scenes so greatly praised by the main reviewer, they are as sparse as they are realistic.  All of the costumes and props in this film are horribly fake.\n\nIn short, the only thing that remains impressive about this film is the fact that Hollywood bothered to put it on DVD.  Apart from that, the acting is as worthless as the contrived screenplay and shallow dialogue.  Don't buy this film", "label": "positive", "processed_sent": "[CLS] King Vidor ' s rather contrived adaptation of Tolstoy ' s epic riddled with miscast actors , a boring script , and a hurried screenplay . In short , another one of those 50 - year old films that have outlived their audience to slowly sink into Hollywood ' s vaults of oblivion . The story follows the main characters of Tolstoy ' s novel such as Natasha ( Audrey Hepburn ) , Prince Andrei ( Mel Ferrer ) , and Pierre ( Henry Fonda . ) The film is too short for the novel and the acting stinks : particularly that of Henry F [SEP]"}, {"sentence1": "Having drooled over the Goodtimes dvd for years now, I did a flip and a half when I saw Universal was releasing a widescreen dvd of this superhot love story. I refrained from doing two flips when I remembered it was Universal and then saw no mention of special features. What? Look at the potential for bonuses! There was an alternate ending, there were deleted scenes, how about a featurette?! Argh! I just wept and wept. And then months later the release date comes, I tear the dvd open and the movie starts automatically - I hit menu and get the nagging old \"operation prohibited by disc\" usually reserved for fast forwarding through those tired old FBI warnings. There's not even a menu! No scene selection. Geez. Do these corporate monoliths now require movies to be no older than 5 days old to have simple menus? I'd like to sit down and analyze the brilliance of Sarandon and Spader, note how Spader's hair changes near the end because of reshoots, but I'm just too raving mad at Universal right now.", "label": "negative", "processed_sent": "[CLS] Having drooled over the Goodtimes dvd for years now , I did a flip and a half when I saw Universal was releasing a widescreen dvd of this superhot love story . I refrained from doing two flips when I remembered it was Universal and then saw no mention of special features . What ? Look at the potential for bonuses ! There was an alternate ending , there were deleted scenes , how about a featurette ? ! Argh ! I just wept and wept . And then months later the release date comes , I tear the dvd open and the movie starts automatically [SEP]"}, {"sentence1": "While the dubbing may be a little annoying, I still love this movie. The fight scenes are great and the movie is pretty funny at times. Driving motorcycles over cars will always be cool in my book. Don't expect the deepest movie in the world, but do expect a quality martial arts film", "label": "negative", "processed_sent": "[CLS] While the dubbing may be a little annoying , I still love this movie . The fight scenes are great and the movie is pretty funny at times . Driving motorcycles over cars will always be cool in my book . Don ' t expect the deepest movie in the world , but do expect a quality martial arts film [SEP]"}]