[{"sentence1": "*No Spoilers*\nWe had enough of lame Japanese films. This new \"wave\" of horror movies like \"The Ring,\" \"Pulse\" and now \"The Grudge 2\" doesn't seem to have an end. The genre is played out but that didn't stop the producers from creating this sequel which is a sad and incomprehensible follow-up of the decent 2004 first version. To understand this film--which is nearly impossible until the end--you would have to see the first movie.\n\nBrief Story:\nThe film has basically three plots, but in a way they are connected to each other. The first plot is a follow-up of what happened to Karen Davis (Sara Michele Gellar) who barely survived the ghosts of the haunted house. Mrs. Davis (Joanna Cassidy) asks her other daughter Aubrey to investigate what happened to her sister Karen. She travels to Japan to bring Sara home. Now in Japan, she finds her in the hospital very paranoid about the ghosts of the house, but something terrible is about to happen.\n\nThe second plot is about three school girls who visit the haunted house. One of the girls has to go to the closet for some kind of initiation that we don't know about. Suddenly the girl sees the ghost of the child. She tries to get out but the door jammed. They all panic and leave the girl in the closet with the ghost. Unfortunately, they are about to find out the hard way that the place was not to be visited. \n\nThe third plot takes place in the US where a new family moves to an old building. A young kid suddenly notices that the building is haunted and the \"strange lady\" that lives next door has something to do with it. People are starting to act weird in this building because of the evil presence. \n\nReview:\nLess scary and sillier than the original, \"The Grudge 2\" takes you to a boring and confusion movie experience. The movie suffers from too many plots that confuse the audience rather than scare them. We have to wait until the end to find out how everything relates to each other. This time around the ghosts are outsourcing from Japan to the US. They don't care whether you visit the house or not. Now these menaces are getting medieval to people for no apparent reason. These ghosts behave now like viruses that will haunt and kill whoever is on their way--even a young little boy--just to show their rage. The so-called scary moments are not scary at all. They are lame, mechanical and cheap imitations of the original 2004 first version. What's sad is that, this time around, the writers have to make the actresses show some \"skin\" to please the male teen audience. This is what the filmmakers have to use to get some kind of momentum going for this movie.\n\nIn the technical department the movie doesn't do a good job either. The editing is very sloppy and extremely confusion. We have three plots that are poorly mixed together. Sometimes we are in Japan and sometimes the ghosts are outsourcing in the US. The photography of the film is identical to its predecessor, but that's the only thing that resemblances the original. In the sound department, the movie will make you laugh. We hear sillier noises than the original. Instead of getting scared, you might laugh at the sounds these ghosts make--We personally like the angry \"kitty\" sound.\n\nThe Verdict:\nA terrible sequel of a decent horror film, \"The Grudge 2\" could have been a straight-to-video release if it wasn't for the beautiful Sara Michelle Gellar. No scary moments but many funny ones--unintentionally, of course.", "label": "2", "processed_sent": "[CLS] * No Spoilers * We had enough of lame Japanese films . This new \" wave \" of horror movies like \" The Ring , \" \" Pulse \" and now \" The Grudge 2 \" doesn ' t seem to have an end . The genre is played out but that didn ' t stop the producers from creating this sequel which is a sad and incomprehensible follow - up of the decent 2004 first version . To understand this film - - which is nearly impossible until the end - - you would have to see the first movie . Brief Story : The film has basically three plots , but in a [SEP]"}, {"sentence1": "I found this a surprisingly engaging treatment of the clone/dysopian theme. I would have given it five stars if they would have explored that a little more and given us a little less of the inevitable tedious car chase/smash up stuff which I tend to yawn through.  Too much of that in the end of the film, almost enough to make me want to walk out, it went on forever.  It would have been better to see more of the clients and the clones' end -- the scenes with Stillweather and the surrogate mother were quite chilling.  Nice touch too, with the bounty hunter finally   \nidentifying with the clones.  The two actors were nothing exceptional, but reasonably competent and more engaging than you'd expect.  The director of the institute was good.  \n\nWorth seeing even if you fast forward through some of the \"action\" scenes  that really slow down the story about 3/4 of the way through. \n\nHow disappointing that the sole \"extra\" feature on the DVD had to do with the ridiculous action scenes and nothing whatsoever about the story itself.  If I could, I'd take off a half point for that.  Why should the whole of the viewing public be regarded as 10 year old boys, who think of nothing beyond the car crashes?  In spite of that they did a surprisingly good film if you can sit through the interminable obligatory \"action\"", "label": "4", "processed_sent": "[CLS] I found this a surprisingly engaging treatment of the clone / dysopian theme . I would have given it five stars if they would have explored that a little more and given us a little less of the inevitable tedious car chase / smash up stuff which I tend to yawn through . Too much of that in the end of the film , almost enough to make me want to walk out , it went on forever . It would have been better to see more of the clients and the clones ' end - - the scenes with Stillweather and the surrogate mother were quite chilling . Nice touch too , with the bounty [SEP]"}, {"sentence1": "This is one of the best series in a LONG time.  I cannot miss an episode.  This DVD is SO WORTH IT and the price is not bad at all for a season of this wonderful show", "label": "5", "processed_sent": "[CLS] This is one of the best series in a LONG time . I cannot miss an episode . This DVD is SO WORTH IT and the price is not bad at all for a season of this wonderful show [SEP]"}, {"sentence1": "One of the most boring....dull....stupid Peter Sellers comedies.  If you can find more then  2 or 3 laughs good luck.  I love Peter Sellers in THE PINK PANTHER movies and he was brilliant in a great number of films.....but he falls far short in this one and Goldie Hawn is wasted totally", "label": "2", "processed_sent": "[CLS] One of the most boring . . . . dull . . . . stupid Peter Sellers comedies . If you can find more then 2 or 3 laughs good luck . I love Peter Sellers in THE PINK PANTHER movies and he was brilliant in a great number of films . . . . . but he falls far short in this one and Goldie Hawn is wasted totally [SEP]"}, {"sentence1": "maybe because I didn't like Porco. Everything was sub-par for me. Animation is definitely not as good as his later movies. Not enough weirdness, tried too much for the plot. Everything was just too ho-hum. As if he tried to carry the whole movie on Porco's shoulders. But once you got past the fact that everyone else was human and Porco was a pig there wasn't anything else there.", "label": "2", "processed_sent": "[CLS] maybe because I didn ' t like Porco . Everything was sub - par for me . Animation is definitely not as good as his later movies . Not enough weirdness , tried too much for the plot . Everything was just too ho - hum . As if he tried to carry the whole movie on Porco ' s shoulders . But once you got past the fact that everyone else was human and Porco was a pig there wasn ' t anything else there . [SEP]"}, {"sentence1": "Surviving 40 Days and Nights without Sex\n\n        In the film 40 Days and 40 Nights, no sex is Kryptonite to Josh Hartnett's character, Matt because he cannot go through a day without thinking of sex and it ruins his social life by not being able to talk to girls without having sex on his mind. He strongly wants to follow through with his promise to himself by staying pure for the entire 40 days and nights.\n\n\tThis film is perfectly made for Josh Hartnett for being such a teenage heartthrob. It's a wonderful comedy full of hilarity and sexy jokes. There are all kinds of things to laugh at such as the bagel guy to the crazy roommate.  Many of the characters in the movie are funny and don't make Matt have such an easy time with the whole 40 days and 40 nights. It's not something that he is capable of doing and they all have faith that he will fail.\n\t\n         Matt being a raging sexaholic is a very strong character who attempts to not have sex for lent. Meaning for an entire 40 days and 40 nights he has to sacrifice what he enjoys most. Each day matt tries to do something constructive that helps him no think about sex, such as model car building and doing laundry. In the work place, Matt's co-workers start a bet to see which day he will break. It later turned into an online betting all over the internet. Prior to all of this he's been on a sex binge because of his girlfriend left him to dry. It's been the only thing that he knows and helps cope with the pain he's suffering.  Matt starts to go through sex withdraw and everything he sees turns into some sexy act in his mind.\n\n        He then meets a girl while doing this laundry one day. Easily there's an attraction but knowing that he cannot have contact with any female physically, he keeps to himself and doesn't say a word to her. As time goes on Matt starts to talk to her and makes a date with her. The date goes wonderful but instilled in his mind is that he can't have any sexual acts with this woman. She finds this weird and at her work place she came upon the website with the online bets. This made things very difficult for him and her. She starts to lose interest in him when he tells her the truth about what he can't do. This is the first time he's felt this way for a woman other than his ex-girlfriend. He truly falls for her and this time he didn't have to have sex. In his mind he wants to get her back so bad but he has that promise to himself that he feels is more important. Now the movie becomes the typical love story where boy meets girl, boy loses girl, then boy will get her back.\n\n\tIn anybody's point of view 40 Days and nights is torture to a character like Matt. Since he's such a lady's man and is extremely sex dependent. Many people know that 40 days isn't that much but to him it feels like an eternity.", "label": "4", "processed_sent": "[CLS] Surviving 40 Days and Nights without Sex In the film 40 Days and 40 Nights , no sex is Kryptonite to Josh Hartnett ' s character , Matt because he cannot go through a day without thinking of sex and it ruins his social life by not being able to talk to girls without having sex on his mind . He strongly wants to follow through with his promise to himself by staying pure for the entire 40 days and nights . This film is perfectly made for Josh Hartnett for being such a teenage heartthrob . It ' s a wonderful comedy full of hilarity and sexy jokes . There are all kinds [SEP]"}, {"sentence1": "I really enjoyed this film, basically the Coen Bros. homage to the film noir genre. (I always thought the name was funny, since it's French, and yet most of famous directors were German, like Fritz Lang, Otto Preminger, etc. :-)). The sure hand of the brothers with this material is shown in how the film unfolds with the cool, unhurried, nonchalant pace of an experienced private eye or gumshoe doggedly stalking his prey. Thornton is great in the lead as the reticent, phlegmatic barber, and if anything, he is even more convincing with hair than without--even his hairpiece is 50s-ish. :-) The whole cast does a fine job in their roles, and both Gandolfini and Shaloub  have a couple of show-stealing scenes. I found the film's climax a complete surprise, as the tables turn unexpectedly on the barber, for whom everything seems to be working out up till then. Overall a great film and probably one of the Coen Bros. best. If you're a Coen Bros. fan you won't find this one a disappointment.", "label": "5", "processed_sent": "[CLS] I really enjoyed this film , basically the Coen Bros . homage to the film noir genre . ( I always thought the name was funny , since it ' s French , and yet most of famous directors were German , like Fritz Lang , Otto Preminger , etc . : - ) ) . The sure hand of the brothers with this material is shown in how the film unfolds with the cool , unhurried , nonchalant pace of an experienced private eye or gumshoe doggedly stalking his prey . Thornton is great in the lead as the reticent , phlegmatic barber , and if [SEP]"}, {"sentence1": "Patch Admas is a real doctor who make people laugh. He use ballons, a pool with pasta and angel costum for dyingman. Is so funny! And Robin Williams is perfect actor for part. He look and act crazy like real doctor, but he also care and love people. He only wanna help. He even trust Larry, who is psyco and kill Patch girlfriend, but she become butterfly, so is ok.\nThe top doctor in hosptal is like nazzi- very evil. He try to stop Patch, but Patch wins trial. \n\nHe is call Patch because he fix old mans coffeecup.\n\nHe become doctor because he long ago want to kill himself but in crazy house he helps his roommate fight fake sqirrles. And he like helping people so he is become doctor.\n\nIn doctor school he want to meet patients and learn there names. He is a different kind doctor for sure!\n\nAnd so funny! He build special hospital for free", "label": "5", "processed_sent": "[CLS] Patch Admas is a real doctor who make people laugh . He use ballons , a pool with pasta and angel costum for dyingman . Is so funny ! And Robin Williams is perfect actor for part . He look and act crazy like real doctor , but he also care and love people . He only wanna help . He even trust Larry , who is psyco and kill Patch girlfriend , but she become butterfly , so is ok . The top doctor in hosptal is like nazzi - very evil . He try to stop Patch , but Patch wins trial . He is call Patch because he fix old mans coffee [SEP]"}, {"sentence1": "The population of Hong Kong is approximately 7 million people. I'd say that about half of them get shot in this movie. Usually when a movie runs over 2 hours, it's because there's a lot of plot that the director wanted to squeeze in. In the case of Hard Boiled, the running time of 126 minutes was clearly necessitated by John Woo's desire to get into the Guinness Book of Records for \"most people killed by gunfire in a single motion picture.\"\n\nChow Yun-Fat is a charismatic actor who can bring a wonderful balletic grace to gunplay, and this movie gives him plenty of opportunity to show his stuff. He shoots (usually with a pistol in each hand) while diving headlong over furniture, while swinging from a rope, while sliding down a banister(!), while being hurled through the air by explosions. Sometimes he even shoots while standing still. And he shoots, and shoots, and shoots. And the bad guys shoot, and shoot, and shoot. And Yun-Fat's fellow cops shoot, and shoot, and -- you get the idea.\n\nThere are some fine action scenes in this film, but my eyes were glazing over long before it ended. There wasn't enough to distinguish one scene of a bunch of people being machine-gunned from the next, and it became painfully repetitious. \n\nPersonally I would highly recommend The Replacement Killers over Hard Boiled. There's plenty of Yun-Fat's balletic shoot-em-up action, but not so much that you find yourself in the odd position of being lulled to sleep by gunfire", "label": "2", "processed_sent": "[CLS] The population of Hong Kong is approximately 7 million people . I ' d say that about half of them get shot in this movie . Usually when a movie runs over 2 hours , it ' s because there ' s a lot of plot that the director wanted to squeeze in . In the case of Hard Boiled , the running time of 126 minutes was clearly necessitated by John Woo ' s desire to get into the Guinness Book of Records for \" most people killed by gunfire in a single motion picture . \" Chow Yun - Fat is a charismatic actor who can bring a wonderful balletic grace to gunplay , and this [SEP]"}, {"sentence1": "JURASSIC PARK is one of the best, if not the best, movies made about dinosaurs ever.  It's also one of only a handful of movies ever made based on a novel that was already in preproduction before the novel ever was released.  It's also one of the first movies to use CGI in significant scenes throughout the film.  It's also the movie that gave Sam Neill a break and reinvigorated the career of Jeff Goldblum.  The movie (promoted by the release of the novel about a year earlier) got the general public (and not just kids) excited about dinosaurs again and did to paleontology as a major what RAIDERS OF THE LOST ARK did to archaeology.\n\nThe premise, seeped in pop science, is that a multi-billionaire, John Hammond (Richard Attenborough) brings dinosaurs back to life by cloning the dino-DNA taken from mosquitoes trapped in amber.  He builds a zoological theme-park he calls Jurassic Park.  However, in order to call off a bunch of lawyers after an accident with one of the park's workers, Hammond has to get a group of scientific experts to endorse that the park is safe and viable.  Thus, Dr. Alan Grant (Sam Neill), Dr. Ellie Sattler (Laura Dern), and Dr. Ian Malcolm (Jeff Goldblum) arrive to tour the facilities.  Hammond's grandchildren, Lex (Ariana Richards) and Tim Murphy (Joseph Mazzello), are also along for the ride as test subjects.  Due to a hurricane and the shenanigans of a greedy employee, the park experiences a major breakdown and the dinosaurs get loose.\n\nJURASSIC PARK set records upon its initial release in 1993 and it isn't difficult to see why.  The CGI effects that have become common in just about every movie since then were in their infancy then, yet the creatures appear completely lifelike.  Of course, Spielberg not only used CGI but he had some live action dinos and models involved as well.  It was a massive undertaking, but one that had a huge payoff.\n\nThere's not much to complain about with JURASSIC PARK.  Sam Neill is great as Dr. Grant (the role was originally offered to Harrison Ford and I'm actually glad he turned it down) and Jeff Goldblum is almost always a delight to watch on screen.  After 15 years of directing his own movies, Richard Attenborough came back for the perfect part as John Hammond.  The action sequences in the film are still as exciting to watch as they were when the film first was in theatres.  The movie is classic Spielberg and those are some of the best movies ever made.\n\nThis DVD includes a very informative documentary about the making of JURASSIC PARK, some clips from an early production meeting (it's probably the closest an average person can come to meeting the real Spielberg), some storyboards and other illustrations, Phil Tippett's Animatic of the \"Raptors in the Kitchen\" sequence showing the raptors as they were originally conceived with having lizard-like tongues, trailers for all three JURASSIC PARK movies, a dinosaur encyclopedia featuring the dinosaurs seen in the movie, some production notes, and a list and partial filmography of the cast & crew", "label": "5", "processed_sent": "[CLS] JURASSIC PARK is one of the best , if not the best , movies made about dinosaurs ever . It ' s also one of only a handful of movies ever made based on a novel that was already in preproduction before the novel ever was released . It ' s also one of the first movies to use CGI in significant scenes throughout the film . It ' s also the movie that gave Sam Neill a break and reinvigorated the career of Jeff Goldblum . The movie ( promoted by the release of the novel about a year earlier ) got the general public ( and not just [SEP]"}, {"sentence1": "Sad to say that many of the fashions worn in the 70s are back on the racks at the mall these days, but that's off the topic.\n\nI enjoyed this movie, and that's a rare thing. The bouncing back and forth in time got to be very confusing and irritating, but in spite of that, the movie survived.\n\nWhile I could have done without quite as much of the sex scenes (really, some subtlety could have conveyed the information just as well), I didn't find them as offensive as some (like those in Deadwood).\n\nJust relax, let the lines blur, and see if you have any of those 70s drugs left..", "label": "4", "processed_sent": "[CLS] Sad to say that many of the fashions worn in the 70s are back on the racks at the mall these days , but that ' s off the topic . I enjoyed this movie , and that ' s a rare thing . The bouncing back and forth in time got to be very confusing and irritating , but in spite of that , the movie survived . While I could have done without quite as much of the sex scenes ( really , some subtlety could have conveyed the information just as well ) , I didn ' t find them as offensive as some ( like those in Deadwood ) . Just relax , let the lines [SEP]"}, {"sentence1": "This movie was a weak effort by Capra, who directed it, and the star, Gary Cooper. It's a good story, just poorly directed (Capra can't hit a home run every time). I found the acting very wooden and the movie seemed to just drag on and on. And no extra features on the dvd, at least none to speak of", "label": "2", "processed_sent": "[CLS] This movie was a weak effort by Capra , who directed it , and the star , Gary Cooper . It ' s a good story , just poorly directed ( Capra can ' t hit a home run every time ) . I found the acting very wooden and the movie seemed to just drag on and on . And no extra features on the dvd , at least none to speak of [SEP]"}, {"sentence1": "Q (Larry Cohen, 1982)\n\nI have very fond memories of seeing this as a teen, and rented it for the purpose of giving it another look though older eyes. Unfortunately, to say Q hasn't aged well is being quite kind.\n\nQuetzalcoatl, the title character, is a very large bird/serpent who's flying around New York eating people who find themselves in high places. At least, he might be Quetzalcoatl (an Aztec god). Or he might just be a big mutant. No one knows. More to the point, no one seems to be overly surprised that there is a large flying serpent picking off New Yorkers. The cops assigned to the case, Shepard (David Carradine) and Powell (Richard Roundtree), certainly take things in stride. The Commissioner (Malachy McCourt, Frank's brother) is the only one who expresses any sort of normal reaction to the events-- disbelief.\n\nWhile the big bird and the cops are the meat of the story, its actual core is Jimmy Quinn (a young Michael Moriarty), a small-time crook who's run afoul of some tough characters through no real fault of his own. Jimmy's odd relationship with the monster could have turned this into a wonderful psychological thriller, and there are glimmers of that sort of thing, but the script never follows through. Q has more the feel of a quickie monster flick-- none of the storylines is explored much beyond the surface, the special effects are alarmingly (and hysterically) low-budget, and the characters, were they to stand still, could often substitute for props. \n\nBut, hey, it's got a big flying lizard. That's something. *", "label": "2", "processed_sent": "[CLS] Q ( Larry Cohen , 1982 ) I have very fond memories of seeing this as a teen , and rented it for the purpose of giving it another look though older eyes . Unfortunately , to say Q hasn ' t aged well is being quite kind . Quetzalcoatl , the title character , is a very large bird / serpent who ' s flying around New York eating people who find themselves in high places . At least , he might be Quetzalcoatl ( an Aztec god ) . Or he might just be a big mutant . No one knows . More to the point , no one seems to be overly surprised [SEP]"}, {"sentence1": "This review is for the 2001 DVD release.\n  Have you ever daydreamed about what you would like to do to your boss who was too hard on you or did something to you objectionable?\n  Well, these secretaries did.  They carried out a plan against their boss and got away with it.\n  Please keep in mind, this film is a comedy and was made to laugh at.\n  However, their are some strong messages here that can be well learned.  Bosses should not verbally abuse and/or sexually intent, touch, harass any employee.  This film does point out employees have rights too.  Managers can be in the wrong too.\n Jane Fonda is \"Judy Bernly\".  Recently divorced.  Has no experience, but is a very decent woman.  Today is her first day at Consolidated Companies LTD.  On her first day everything goes wrong.\n  Lily Tomlin is \"Violet Newstead\".  She has worked their forever.  Never spies.  She is ready for a promotion. She trains Judy on her first day.  In fact, Violet has trained most of the people there and they have been promoted instead of her.\n  Dolly Parton (in her first film) is \"Doralee Rhodes\".  Mr. Hart's main secretary.  There is bad gossip going around about the boss and the secretary, but it is not true.  Doralee is a married woman  and is a Christian and pure as Judy is and would never engage in bad behavior at work.\n  Dabney Coleman is the boss, \"Franklin Hart\". He is the boss and the vice-president.  Has has a bad mouth towards secretaries and wants \"personal servitude\" that is not part of the job description.\n  After the boss makes personal advances towards Doralee, makes inappropriate comments towards Violet and dismisses Maria (Roxanna Bonilla-Giannini) for having light conversation in the bathroom and guessing the bosses salary, and after another incident, Violet, along with Doralee and Judy later decide that something has to be done to the boss and improvements must be made within the company.\n  Better working conditions for all.  Violet just might get her promotion yet.\nAlso in the cast: Elizabeth Wilson, Peggy Pope, Sterling Hayden, Lawrence Pressman, Marian Mercer.\n  Yes, that is Dolly Parton singing \"Nine To Five\".\n\n Jane Fonda and Dabney Coleman also worked together in On Golden Pond (1981).\n  Followed by the tv series Nine To Five (1982-83) with Rita Moreno as \"Violet\", Valerie Curtin as \"Judy\", and Rachel Dennison as \"Doralee\".  Jane Fonda was one of the Producers and Executive Producers.  Rachel Dennison is Dolly Parton's real-life sister.\n  Update: As of April 2006, the cast reunited to celebrate the 2006 DVD release.  According to Jane Fonda on \"Larry King Live\", they are in \"talks\" of a sequel", "label": "4", "processed_sent": "[CLS] This review is for the 2001 DVD release . Have you ever daydreamed about what you would like to do to your boss who was too hard on you or did something to you objectionable ? Well , these secretaries did . They carried out a plan against their boss and got away with it . Please keep in mind , this film is a comedy and was made to laugh at . However , their are some strong messages here that can be well learned . Bosses should not verbally abuse and / or sexually intent , touch , harass any employee . This film does point out employees have rights too . Managers can be in [SEP]"}, {"sentence1": "I found it to be very funny and I throughly enjoyed it,there should be more movies to keep people laughing", "label": "5", "processed_sent": "[CLS] I found it to be very funny and I throughly enjoyed it , there should be more movies to keep people laughing [SEP]"}, {"sentence1": "Ferris Bueller (Matthew Broderick) is a kind of hero to every high-school aged young adult out there. He's the kind of guy whom we all want to be, really. He acts like he doesn't have a care in the world, and lives life to fullest. The opposite of this guy would be his best friend Cameron Frye (Alan Ruck), a sort of uptight worrywart who deserves to be brought out of his shell by the easygoing Ferris. In this film, Ferris fakes out his parents into calling it another \"sick\" day for him, his ninth to be exact. In order to convince just about everyone that he is really sick, he consults his collection of electronic sound effect equipment for the process. Another antithesis of Ferris is his life-is-not-fair sister Jeannie(Jennifer Grey) who suspects something is up, as does the sly-but-not-so-slick Dean of Students, Ed Rooney (Jeffrey Jones).\nIt's funny how so many trains of thoughts seem to dominate this movie and in the events that happen For instance, Ferris says that he has to keep coming up with new illnesses in order to make 10 sick days. It's amazing; people, like his parents who are most easily duped, would think that this one sick kid when in reality, he's having a ball. However, knowing that if he gets cauught and may not graduate, he decides to make this one count and be worthwhile. Ferris and Cameron bail out Ferris' girl Sloane (Mia Sara) with a dead grandmother ploy, and together the trio spend the day doing the town in Chicago driving the '61 GT convertible (Oh, yeah!). This movie has a special message and feeling to it that's as old as time. It's about conquering fears mostly and just really appreciating life. For after all, as our hero says: \"Life moves pretty fast; if you don't stop to take a look every once in a while, you might miss it.\" That's the moral of the story, really. \n\"Bueller...Bueller...Bueller?\" Not here, but he'll be there in your own home sharing his funny but wise philosophies of life, and showing you how to open your eyes in making the most of every day", "label": "5", "processed_sent": "[CLS] Ferris Bueller ( Matthew Broderick ) is a kind of hero to every high - school aged young adult out there . He ' s the kind of guy whom we all want to be , really . He acts like he doesn ' t have a care in the world , and lives life to fullest . The opposite of this guy would be his best friend Cameron Frye ( Alan Ruck ) , a sort of uptight worrywart who deserves to be brought out of his shell by the easygoing Ferris . In this film , Ferris fakes out his parents into calling it another \" sick \" day for him , [SEP]"}, {"sentence1": "\"She's Having A Baby\" is a must for any fan of 80's films.  If you *are* in fact having a baby or thinking about trying you will surely be able to find humor in watching this.  Some people say this is a \"chick-flick\", but I think it is for anyone.  This John Hughes film is another great one.  I am happy to finally have the DVD.\n\nThe soundtrack is great, too", "label": "5", "processed_sent": "[CLS] \" She ' s Having A Baby \" is a must for any fan of 80 ' s films . If you * are * in fact having a baby or thinking about trying you will surely be able to find humor in watching this . Some people say this is a \" chick - flick \" , but I think it is for anyone . This John Hughes film is another great one . I am happy to finally have the DVD . The soundtrack is great , too [SEP]"}, {"sentence1": "This is the way more movies should be made! It shows excellent talent, has a lot of humor and is super intertaining. And under it all are some great lessons in curtesy, honesty and ethics! I feel good after viewing it", "label": "5", "processed_sent": "[CLS] This is the way more movies should be made ! It shows excellent talent , has a lot of humor and is super intertaining . And under it all are some great lessons in curtesy , honesty and ethics ! I feel good after viewing it [SEP]"}, {"sentence1": "Considering all the bad press Tom Cruise and this film got earlier this year I wasn't expecting this film to be all that great.  I mean, by the time you get to the third sequel of film there is rarely anything original left.  Granted, this film is not the most original of plots, but I was pleasantly surprised by how good it was, what a great job J. J. Abrams did, and what a great cast the film had.  It was much better than I expected it would be.  As you watch the film, you can definitely see J. J.'s \"Alias\" touches all over the place.  There were even a few times when I wondered if Sydney Bristow was going to jump, which would have been SO cool.  Tom Cruise too a lot of crap for this film, whether that was deserved or not due to some of his antics I don't know, but he was very good in the film and it keeps you attention from start to finish.  If you're looking for a great action film that is also beautifully filmed and well acted, M:I3 is your film", "label": "4", "processed_sent": "[CLS] Considering all the bad press Tom Cruise and this film got earlier this year I wasn ' t expecting this film to be all that great . I mean , by the time you get to the third sequel of film there is rarely anything original left . Granted , this film is not the most original of plots , but I was pleasantly surprised by how good it was , what a great job J . J . Abrams did , and what a great cast the film had . It was much better than I expected it would be . As you watch the film , you can definitely see J . J . ' s \" Alias \" touches all [SEP]"}, {"sentence1": "Hollywood make them, then they break them -- stars can fall as fast as they rise. Sometimes they rise again, and sometimes they disappear. \n\nAnd Christopher Guest casts a jaded eye on the fickle ups and downs of Hollywood in \"The Big Picture,\" a quirky, cynical movie which focuses on what the successful should never let go of. It has a few awkward stretches, but overall it's a darkly witty cult comedy (\"You're tracking failure all over my carpet!\").\n\nNick Chapman (Kevin Bacon) is the winner at an arty student movie competition, and instantly agents are chasing him all over L.A. In no time, he's the Rising Young Director, with a movie deal at a major movie corporation. But he's also starting to lose sight of his old life, as he tries to become a major success.\n\nHe changes the style, plot and characters of his arty movie for demographics, turning it into a beach bums/naked ghost movie. He dumps his pretty girlfriend (Emily Longstreth) for a bimbo actress (Teri Hatcher). When the studio head gets dropped, Nick falls as quickly as he rose. But a chance encounter with an old pal gives him a second chance -- an arty music video. This time, can he get it right?\n\nChristopher Guest is best known for his brilliant mockumentaries, tackling everything from small-town musicals to folk festivals. His forthcoming one is another one about showbiz. But his talents are just as present in a \"typical\" movie, and Guest does a smart, quirky job of it.\n\nThe lesson: Be true to yourself and your art, don't fall for empty glitz, and don't let success go to your head if you're lucky enough to get it. \n\nThe story is a pretty straightforward one -- Nick gets great success, it goes to his head, he falls, and he rises again a wiser man. And the movie falls into straightforward lines, without many unpredictable plot twists. At first glance, it doesn't seem that unusual.\n\nWhat makes it special? Well, simply put, Guest manages to infuse it with his unique type of wit, like the oddballish Pez music video and the noir fantasies of Nick's life. Not to mention the glorious dialogue. When speaking of Nick's one'n'only music video, a studio woman announces, \"It's the best one yet, and I've seen 'em ALL!\"\n\nAnd Guest manages to show us agents, artists, students, directors and actors, but never descended to cliches. They're real people, no matter how nasty. And Bacon does a solid job as a young man who learns how empty glitz is. His best scene is the reunion with his friend Emmet, where he confesses, \"I wanna be your friend again.\" And he's backed by good performances by Longstreth, Michael McKean and a dancing Jennifer Jason Leigh.\n\n\"Big Picture\" treads where many movies have gone before, but it does so with an approach as fresh as a Pez People music video. A must-see", "label": "4", "processed_sent": "[CLS] Hollywood make them , then they break them - - stars can fall as fast as they rise . Sometimes they rise again , and sometimes they disappear . And Christopher Guest casts a jaded eye on the fickle ups and downs of Hollywood in \" The Big Picture , \" a quirky , cynical movie which focuses on what the successful should never let go of . It has a few awkward stretches , but overall it ' s a darkly witty cult comedy ( \" You ' re tracking failure all over my carpet ! \" ) . Nick Chapman ( Kevin Bacon ) is the winner at an arty student movie competition , [SEP]"}, {"sentence1": "I bought this DVD thinking I could get what my Pilates class gives me right at home.  Boy was I wrong.  This is a horrible example of Pilates.  The sessions just goes through the motions.  They don't emphasize the importance of form and breathing through out each session which is really needed for any skill level.  The transitions are way too fast.  Maybe I am spoiled by having such a great Pilates teacher but this DVD is a waste of money!", "label": "2", "processed_sent": "[CLS] I bought this DVD thinking I could get what my Pilates class gives me right at home . Boy was I wrong . This is a horrible example of Pilates . The sessions just goes through the motions . They don ' t emphasize the importance of form and breathing through out each session which is really needed for any skill level . The transitions are way too fast . Maybe I am spoiled by having such a great Pilates teacher but this DVD is a waste of money ! [SEP]"}, {"sentence1": "Happy Gilmore is one of the funniest movies I have ever seen. Then I watched Billy Madison and it was about a totally moronic spoilt rich kid. Total opposites sometimes don't atract.", "label": "2", "processed_sent": "[CLS] Happy Gilmore is one of the funniest movies I have ever seen . Then I watched Billy Madison and it was about a totally moronic spoilt rich kid . Total opposites sometimes don ' t atract . [SEP]"}, {"sentence1": "Michael Moriarity is my hero! He is just one of the coolest actors in my opinion. He has done such great B-movies as this, Q, and It's Alive 3: Island of the Alive. How awesome is he?? Anyways, I think that this movie was hilarious! I think a lot of people take this movie too seriously, thinking that it is going to be your typical movie. But you shouldn't because not only is this a B-movie, but IT IS supposed to be funny. My favorite part is when \"the stuff\" started bubbeling out of the ground and that old hick guy just starts eating it. Who would do that?? I just started laughing by butt off when that happened. So if you watch this movie, just sit back and enjoy it for what it's worth, don't be too critical on it.\nWhat I learned from The Stuff: Dairy products are evil! Especially if they come from with in the earth!\nIf you like The Stuff, I recommend: Watching other B-movies, such as Island of the Alive 3, Zombi 3 and 4, etc", "label": "2", "processed_sent": "[CLS] Michael Moriarity is my hero ! He is just one of the coolest actors in my opinion . He has done such great B - movies as this , Q , and It ' s Alive 3 : Island of the Alive . How awesome is he ? ? Anyways , I think that this movie was hilarious ! I think a lot of people take this movie too seriously , thinking that it is going to be your typical movie . But you shouldn ' t because not only is this a B - movie , but IT IS supposed to be funny . My favorite part is when \" the stuff \" started bubbeling out [SEP]"}, {"sentence1": "I have been a huge fan of this movie since it hit the big screen in 1983. I was a little skeptical of the new version but I have to say that I like this version even better. The change in the musical score does not bother me like others have written in their reviews. If you like the original you will like this version as well", "label": "5", "processed_sent": "[CLS] I have been a huge fan of this movie since it hit the big screen in 1983 . I was a little skeptical of the new version but I have to say that I like this version even better . The change in the musical score does not bother me like others have written in their reviews . If you like the original you will like this version as well [SEP]"}, {"sentence1": "This is an adorable movie. It's low-budget and the acting is not\nspectacular, but nevertheless, it's a cute story with sexy characters and an impressive, unique plot.\n\nConrad is a successful, attractive man recently heart-broken. Venturing into the unknown, he hires a sex worker for the night. As it turns out, his hired man, Ian, is quite the catch -- a young, charming, sexy Australian trying to save money to stay in the country. Soon enough, Ian is in Conrad's life every day, though not as you may think.\n\nAs Ian moves into Conrad's social life, everyone's issues come to the surface. Love stories unfold and redevelop, problems at home collide with life at work, the truth behind Ian's need to do sex work comes out, and everyone is in for a wake-up call about life and what they need.\n\nBasically, it's genuine, it's cute and charming, and it deals with real-life problems, most of which just happen to be gay, a definite plus in my book. So give its budget a break and sit back and enjoy a film well-worth seeing.", "label": "4", "processed_sent": "[CLS] This is an adorable movie . It ' s low - budget and the acting is not spectacular , but nevertheless , it ' s a cute story with sexy characters and an impressive , unique plot . Conrad is a successful , attractive man recently heart - broken . Venturing into the unknown , he hires a sex worker for the night . As it turns out , his hired man , Ian , is quite the catch - - a young , charming , sexy Australian trying to save money to stay in the country . Soon enough , Ian is in Conrad ' s life every day , though not as you may think . As Ian moves into Conrad [SEP]"}, {"sentence1": "No reviews for this video as the disk I have got has nothing recorded on it and it has a flat and rough gray inside surface with no silver surface of recorded movie and when inserted into the player a message of No Disk is displayed. As the shipping cost is to be born by the buyer in case a DVD is defective and in my case the shipping cost is much more than the DVD as i have to ship in from India. So I can just throw it in the garbage bin and suggest you guys that kindly watch out for this disk.", "label": "2", "processed_sent": "[CLS] No reviews for this video as the disk I have got has nothing recorded on it and it has a flat and rough gray inside surface with no silver surface of recorded movie and when inserted into the player a message of No Disk is displayed . As the shipping cost is to be born by the buyer in case a DVD is defective and in my case the shipping cost is much more than the DVD as i have to ship in from India . So I can just throw it in the garbage bin and suggest you guys that kindly watch out for this disk . [SEP]"}, {"sentence1": "This video is great in that it shows a very wide veriety of animals. However its hard for kids to pick out the actual name of each animal from the rest of the information they give on each one. I would prefer if they show the cow, say COW and then go on to tell about it. But they show a cow and go right into their speech about cows. My son didn't like it at first, but now that he's learned his animals from books, he really likes to watch it and point out all the different animals he knows", "label": "4", "processed_sent": "[CLS] This video is great in that it shows a very wide veriety of animals . However its hard for kids to pick out the actual name of each animal from the rest of the information they give on each one . I would prefer if they show the cow , say COW and then go on to tell about it . But they show a cow and go right into their speech about cows . My son didn ' t like it at first , but now that he ' s learned his animals from books , he really likes to watch it and point out all the different animals he knows [SEP]"}, {"sentence1": "I loved this movie. It was very touching and projected a wonderful image. It was a rare find", "label": "5", "processed_sent": "[CLS] I loved this movie . It was very touching and projected a wonderful image . It was a rare find [SEP]"}, {"sentence1": "AFTER VIEWING THE AVENGERS WITH EMMA PEEL, WHICH I DO EVERY EVENING AFTER THE DREADFUL NEWS, ENJOYING REPEATS AND REPEATS AS WELL, WITH RELUCTANCE I PLAYED THE HOSPITAL DVD.\n\nI THOUGHT IT WAS TERRIBLE. THE DIAGOGUE IDIOTIC.\n\nI COULD NOT HELP BUT LAUGH WHEN SCOTT ATTACKED DIANA.  EMMA PEEL WOULD HAVE THROWN HIM ACROSS THE ROOM.\n\nI HAD TO PLAY A FEW EPISODES OF EMMA PEEL IN THE AVENGERS SERIES TO CLEANSE ME OF THIS DISAPPOINTING AND TERRIBLE HOSPITAL DVD.\n\nTHE LOVELY DIANA RIGG IS A GREAT ACTRESS AND AN EXTREMELY INTELLIGENT WOMAN, AND I WAS SADDENED THAT DIANA AFTER ALL THOSE WONDERFUL AND EXCITING AVENGERS COLLECTION, WITH HER UNRIVALED BEAUTY AND POSSESSING THE MOST BEAUTIFUL VOICE AND ABLE TO DO HER  OWN STUNTS TOOK ON THIS DISMAL ROLE IN THE HOSPITAL DVD.\n\nI SEE THAT THIS DVD WAS DATED 1971, THIS WAS ONLY 4 YEARS AFTER HER LAST AVENGER EPISODES DATED 1967.  IN HOSPITAL, I BELIEVE SHE WAS 33 YEARS OLD.\n\nOH WELL, I WILL CLEANSE MYSELF OF THIS HOSPITAL DVD AND DEVOTE AN EVENINGR TO A FEW EPISODES OF THE AVENGERS WITH THE LOVELY DIANA RIGG AS EMMA PEEL.\n\nFINALL, JOHN STEED WOULD HAVE BEEN SHOCKED TO SEE HOW EMMA REACTED TO GEORGE SCOTT THE DOCTOR. CAN YOU IMAGDINE IF JOHN STEED APPEARED IN THE HOSPITAL DVD TO COLLECT DIANA RIGG AND RIDE OFF INTO THE SUNSET AS THEY DO AFTER AN AVENGER EPISODE.\n\nPERHAPS THEY WILL ISSUE HOSPITAL 11, AND BRINGR IN JOHN STEED AND A FEW OTHER GREAT ACTORS OF THAT SERIES.\n\nROBERT LYONS\nRENO, NEVAD", "label": "2", "processed_sent": "[CLS] AFTER VIEWING THE AVENGERS WITH EMMA PEEL , WHICH I DO EVERY EVENING AFTER THE DREADFUL NEWS , ENJOYING REPEATS AND REPEATS AS WELL , WITH RELUCTANCE I PLAYED THE HOSPITAL DVD . I THOUGHT IT WAS TERRIBLE . THE DIAGOGUE IDIOTIC . I COULD NOT [SEP]"}, {"sentence1": "De Niro is a great actor. No one questions that, but lately people have been criticizing him for the roles he chooses to take, with his presence being the only saving grace in some of those films (Showtime for example). Fortunately this movie does not require De Niro to make it stand although his presence in it definitely makes it that much better. \n\nThe story is an excellent one that reminds us all of the importance of family in the development of a child. De Niro is a dead-beat dad whose refuge from his failures is in his job as a policeman. His son, possibly as a result of his lack of a role model in life turns out to be a junkie who feeds his habit by any possible means. \n\nOne night while buying some drugs, the situation becomes ugly and he murders the drug-dealer unintentionally. From there things go downhill (as if things weren't already bad). He is wanted by the supplier of his supplier and by the Police (including his father) for the murder of the drug-dealer. To add to the already messed up situation, his girlfriend is almost penniless and has to look after his son while he finds a way to clean himself up. In addition to all that, Deniro's already inimical relationship with his ex-wife becomes even more strained when he has to face her to talk to her about their son.\n\nThis is realistic drama and it deals with the choices that we all make in life and the responsibilities we have to face up to, some of the speeches in the film really drive this point home. -\n\nDeniro : I remember the day you were born \nSon: I remember the day you left\n(When Deniro tries to convince son to hand himself over)\n \n An earlier reviewer mentioned the realism in this movie and I would have to agree, Deniro is a versatile actor, and he is convincing in this role (you completely forget he was the Don once) the supporting cast is brilliant and make this film entertaining.\n\nI would highly recommend this film, a good message and a great movie.", "label": "4", "processed_sent": "[CLS] De Niro is a great actor . No one questions that , but lately people have been criticizing him for the roles he chooses to take , with his presence being the only saving grace in some of those films ( Showtime for example ) . Fortunately this movie does not require De Niro to make it stand although his presence in it definitely makes it that much better . The story is an excellent one that reminds us all of the importance of family in the development of a child . De Niro is a dead - beat dad whose refuge from his failures is in his job as a policeman . His son , possibly as a result of his lack [SEP]"}, {"sentence1": "One of the best films of all time!  Fans of Katharine Hepburn and Cary Grant are in for a treat with this one", "label": "5", "processed_sent": "[CLS] One of the best films of all time ! Fans of Katharine Hepburn and Cary Grant are in for a treat with this one [SEP]"}, {"sentence1": "This movie was very entertaining.  It had several messages which proved to be both interesting and helpful.  It is also a powerful story which depicts how things have a way of coming together when we work as a team in spite of our differences.  I'm sure I will be showing this over and over again with my family and friends.", "label": "4", "processed_sent": "[CLS] This movie was very entertaining . It had several messages which proved to be both interesting and helpful . It is also a powerful story which depicts how things have a way of coming together when we work as a team in spite of our differences . I ' m sure I will be showing this over and over again with my family and friends . [SEP]"}, {"sentence1": "Definitely a GREAT movie, Instinct, brings to the screen the story of a scientist studying gorillas in Africa who after being \"lost\" for two years re-appears as a psychopath prisoner charged with multiple assaults and double murder.  A young psychiatrist is then given the task of \"evaluating\" the patient, though what he finds is more than he bargained for...\nAnthony Hopkins, Cuba Gooding Jr., and the rest of the cast have truly outdone themselves with their performances, which are extraordinary to say the least!  All the actors, without exceptions, give it their 100% and it really shows (the chemistry is AMAZING)! The film is simple enough, but does a great job of describing people's every day lives and the problems they face.  It just goes to show that simplicity is often far better than complexity, when trying to present issues of a human nature. \nThe plot, the setting, the dialogues, and the music, are all WONDERFUL!\nVery well written and very well presented, the movie is without a doubt worth watching and one to seriously consider adding to your movie collection (if you haven't already done so)!\nIn conclusion, it is one of those films that gets you and keeps you thinking long after it's over.", "label": "5", "processed_sent": "[CLS] Definitely a GREAT movie , Instinct , brings to the screen the story of a scientist studying gorillas in Africa who after being \" lost \" for two years re - appears as a psychopath prisoner charged with multiple assaults and double murder . A young psychiatrist is then given the task of \" evaluating \" the patient , though what he finds is more than he bargained for . . . Anthony Hopkins , Cuba Gooding Jr . , and the rest of the cast have truly outdone themselves with their performances , which are extraordinary to say the least ! All the actors , without exceptions , [SEP]"}, {"sentence1": "The slick stylish Spanish thriller \"Nobody Knows Anybody\" is set in Seville during Holy Week in the year 2000. Newspaper crossword puzzle developer and would-be writer Simon Cardenas (Eduardo Noriega) is struggling as usual with his novel when he receives a cryptic telephone message ordering him to use the word \"adversary\" as an answer to an upcoming crossword clue. Since the message also contained threats, Simon does what he's told, and he soon finds himself embroiled in a nightmarish sequence of events. \n\nDirected by Mateo Gil, \"Nobody Knows Anything\" opens with a scene of a man stabbed to death with a crucifix through his heart, and this scene is one of the ideas that feeds the notion you are about to see some sort of horror film with religious overtones, but the plot moves away from the horror aspect into straight thriller territory. The film--which owes much of its style to American thrillers--is slickly produced, and the exotic settings of the sights and sounds of Seville help, but the preposterous plot with its huge gaps in logic and implausibility ultimately left this viewer disappointed and feeling a bit cheated by the experience. \n\nI was intrigued at first by the film and drawn into the plot. However, once the plot and the mystery aspect became clear (and I can't give away too much here), the film became silly and trite. There's little character development--our hero is a flat, dull passive character, and the film's emphasis is on the thrill aspect. A slick product that is ultimately empty and really ridiculous, this film is in Spanish with English subtitles--displacedhuma", "label": "2", "processed_sent": "[CLS] The slick stylish Spanish thriller \" Nobody Knows Anybody \" is set in Seville during Holy Week in the year 2000 . Newspaper crossword puzzle developer and would - be writer Simon Cardenas ( Eduardo Noriega ) is struggling as usual with his novel when he receives a cryptic telephone message ordering him to use the word \" adversary \" as an answer to an upcoming crossword clue . Since the message also contained threats , Simon does what he ' s told , and he soon finds himself embroiled in a nightmarish sequence of events . Directed by Mateo Gil , \" Nobody Knows Anything \" opens [SEP]"}, {"sentence1": "Meet the Fockers to me was a really funny movie.  Ben Stiller is like my alltime favortite actor and he did do a great job in this movie. However, the original (Meet the parents) was a five star all the way.  This one to me was not as good but it did have it's moments.  If you were to go and buy this movie, watch the original first.  (If you haven't seen the original movie, I strongly recommend watching that one first.  After watching the original, you'll probably argee that Meet the Fockers was not as good", "label": "4", "processed_sent": "[CLS] Meet the Fockers to me was a really funny movie . Ben Stiller is like my alltime favortite actor and he did do a great job in this movie . However , the original ( Meet the parents ) was a five star all the way . This one to me was not as good but it did have it ' s moments . If you were to go and buy this movie , watch the original first . ( If you haven ' t seen the original movie , I strongly recommend watching that one first . After watching the original , you ' ll probably argee that Meet the Fockers was not as good [SEP]"}, {"sentence1": "This film seems to be known worldwide as a \"chick flick\", from the romantic aspects of it, to the current anniversary DVD's pink cover.\n\nI'm an 18 year old guy who absolutely digs this film, especially due to the Holly Golightly character. After viewing this film for the first time, I developed a crush on the character Holly (kind of goofy, I guess, but it's very hard for me to dislike a character like her.) Audrey Hepburn played her to perfection. The film was also brilliantly shot by Franz Planer and directed by Blake Edwards. I love the film's dialogue as well, it has a very realistic quality, and it's so fun to hear the characters converse with each other.\n\n\"Breakfast At Tiffany's\" is perhaps the best \"date\" movie ever conceived.  This film is an absolute classic that is worth subsequent viewings and it will never age.", "label": "5", "processed_sent": "[CLS] This film seems to be known worldwide as a \" chick flick \" , from the romantic aspects of it , to the current anniversary DVD ' s pink cover . I ' m an 18 year old guy who absolutely digs this film , especially due to the Holly Golightly character . After viewing this film for the first time , I developed a crush on the character Holly ( kind of goofy , I guess , but it ' s very hard for me to dislike a character like her . ) Audrey Hepburn played her to perfection . The film was also brilliantly shot by Franz Planer and directed by Blake Edwards . I love the [SEP]"}, {"sentence1": "Is Larry an actual redneck, or is it all really a joke inside \"Larry's\" mind?  I sometimes think that Dan Whitney (Larry's real name) knows what he's doing.  I think he is actually making a huge joke out of the rednecks who are totally in love with him.  He is openly mocking them, and when they might get a tad uncomfortable, but then he'll drop a politically incorrect joke into the routine, and they love him again.  Dan/Larry started out as a \"normal\" comedian (there's footage of him on youtube before his Larry incarnation), and wasn't really getting anywhere with that.  So he became a redneck, and is a multi-millionare now.  But all his redneck fans think of Larry as a \"regular guy\", despite the fact that Larry lives in one of those fancy houses that rednecks think only NYCers live in (for the record, NYCers don't all live in fancy houses.  There's a lot of working class people in NYC who live in regular houses and regular apartments).  So Larry is taking advantage of illiterate, easily amused rednecks.  Just put on a flannel shirt, fart, wear a Confederate flag, and say you hate liberals, then fleece the rednecks!  I don't think Larry really has a redneck mentality (even though he's originally from Nebraska, so he has some hillbilly cred, so to speak).  I think he's just making a ton of money off of easily amused people.", "label": "2", "processed_sent": "[CLS] Is Larry an actual redneck , or is it all really a joke inside \" Larry ' s \" mind ? I sometimes think that Dan Whitney ( Larry ' s real name ) knows what he ' s doing . I think he is actually making a huge joke out of the rednecks who are totally in love with him . He is openly mocking them , and when they might get a tad uncomfortable , but then he ' ll drop a politically incorrect joke into the routine , and they love him again . Dan / Larry started out as a \" normal \" comedian ( there ' s footage of him on youtube before his Larry [SEP]"}, {"sentence1": "I just love this movie, but it may not be for all, since it is a very specific type of humor. Don't expect \"Best in Show\" or \"Waiting for Gufman,\" because this is not a mockumentary, but rather a really funny movie about the ups and downs in Hollywood. And may I add, very on point.  I just love it more and more...and wish Guest would direct another one this funny.\n\nIn love with both Emily Longstreth and Teri hatcher. I can't pcik which one, so I'll choose both", "label": "5", "processed_sent": "[CLS] I just love this movie , but it may not be for all , since it is a very specific type of humor . Don ' t expect \" Best in Show \" or \" Waiting for Gufman , \" because this is not a mockumentary , but rather a really funny movie about the ups and downs in Hollywood . And may I add , very on point . I just love it more and more . . . and wish Guest would direct another one this funny . In love with both Emily Longstreth and Teri hatcher . I can ' t pcik which one , so I ' ll choose both [SEP]"}, {"sentence1": "The story here dosen't matter. The main characters fuse into a missle of meth and insanity towards an explosive ending. Scwartzman escapes his fate temporarily and murphy is blessed with a reprieve but rourke pays the full price for his evil concoction, meth. Quirky directing and film editing can be somewhat distracting but not meaningless. Roberts is so gay you want to smack his face. he an rourke have history on film and play out their familiarity. Rourke is phenomonal again as an immoral genius, a role he plays better than anyone today in film. BR", "label": "2", "processed_sent": "[CLS] The story here dosen ' t matter . The main characters fuse into a missle of meth and insanity towards an explosive ending . Scwartzman escapes his fate temporarily and murphy is blessed with a reprieve but rourke pays the full price for his evil concoction , meth . Quirky directing and film editing can be somewhat distracting but not meaningless . Roberts is so gay you want to smack his face . he an rourke have history on film and play out their familiarity . Rourke is phenomonal again as an immoral genius , a role he plays [SEP]"}, {"sentence1": "In this movie that was supposedly inspired by the true story of Frank T. Hopkins, Viggo Mortenson does an excellent job of portraying the character.  Whether there actually was the race as described in the movie and whether Frank T. Hopkins actually existed is irrelevant.  What is important is that the movie is enjoyable and the race is nicely plotted.\n\nFrank T. Hopkins is an accomplished rider.  He has been a dispatch rider for the U.S. Army, a Pony Express rider, and he has been in Buffalo Bill's Wild West show.  Frank appears well on his way to alcoholic oblivion when he is asked to race in the 3000 mile Ocean of Fire, a race that has been held for one thousand years.  After the obligatory refusal (all movies of this type must have the humble hero refuse to be a hero) he travels by sea to the Middle East.\n\nA side note.  The movie begins with the infamous Wounded Knee massacre.  The memory of that horrific even supposedly haunts Frank.  I will discuss these distractions more later in this review.\n\nThis movie finally comes into its own when the Ocean of Fire race begins.  Several of the sponsors of the race have their own agendas for winning the race.  Numerous attempts are made to kill Frank during the race.  Of course, Frank manages to survive all these attempts.  He also manages to rescue a kidnapped princess, and to save his horse from spikes, big cats, and bullets, not to mention heat, thirst and hunger.  Nearly every part of the movie that deals with the race is quite good and entertaining.\n\nThe title of the movie comes from the mustang named Hidalgo.  Hidalgo has a lot of heart and a lot of character.  Hidalgo was smarter than many of the characters in this movie.  Sales of horses will go up as a result of this movie.\n\nThe only issue I had with this movie was the distractions.  I thought the Wounded Knee massacre, while a horrible incident and one worthy of a separate movie, to be a distraction from the race.  Even though Frank later saw his ancestors in a hallucination in the desert, we did not need the massacre to recognize who they were.  I also thought the release of the wild mustangs by Frank could have been handled more succinctly, though I admit that seeing mustangs running across the plains of the Midwest was inspiring.  Throwing in all the details about Jazira, the daughter of Sheikh Riyadh (played by the great Omar Sharif) were further distractions.  The result is a movie that is bloated in places and begins too slowly.\n\nI thought Viggo Mortenson was great as Aragorn in the Lord of the Rings movies.  He does an equally good job as Frank T. Hopkins.  Enjoy the race; enjoy the rescue of the princess; fast forward through the rest.", "label": "4", "processed_sent": "[CLS] In this movie that was supposedly inspired by the true story of Frank T . Hopkins , Viggo Mortenson does an excellent job of portraying the character . Whether there actually was the race as described in the movie and whether Frank T . Hopkins actually existed is irrelevant . What is important is that the movie is enjoyable and the race is nicely plotted . Frank T . Hopkins is an accomplished rider . He has been a dispatch rider for the U . S . Army , a Pony Express rider , and he has been in Buffalo Bill ' s Wild West show . Frank appears well on his way to alcoholic oblivion when he is asked [SEP]"}, {"sentence1": "Crude language, Wild philosophy taken to an extreme.  The attitudes and language are what makes this movie rated R.  Even though it may seem like all fun and games, and you may not want to say otherwise, you know it's more than that.  Looking at the title, it sounds like it could be another comedic happy go lucky film.  Right about the comedic part, but so wrong on everything else.  There are hearts broken in ways you wouldn't have imagined, two Huckabee models and \"everything else Huckabees.\"  Jason Schartzman plays the main character, and I found out that he's the drummer in Phantom Planet, a great pop band!  (I hear he's arrogant though, and this fact only would enhance it.)  Dustin Hoffman and Jude Law are in it.  Mark Wahlberg is truly convincing in this one.  If you like South Park, Daria, or any kind of toilet humor, this movie may just be for you", "label": "5", "processed_sent": "[CLS] Crude language , Wild philosophy taken to an extreme . The attitudes and language are what makes this movie rated R . Even though it may seem like all fun and games , and you may not want to say otherwise , you know it ' s more than that . Looking at the title , it sounds like it could be another comedic happy go lucky film . Right about the comedic part , but so wrong on everything else . There are hearts broken in ways you wouldn ' t have imagined , two Huckabee models and \" everything else Huckabees . \" Jason Schartzman plays the main character , and I found out [SEP]"}, {"sentence1": "For what it is, this movie is great. Very not typical of a Robin Williams film, but that's just my opinion.  I have seen Robin do so much, from comedy, to this. I was very impressed with his acting. He made the movie and played the character perfectly. \n\nPlot\nThis movie is basically about a photo obsessed freak who is lonely and shares his time constrcuting a collage of a frequent customer's family at the photo place he works at.  After he is found out, the movie really starts to get interesting. \"Cy\" (Robin williams) does a variety of things to give off that \"freaky, stalker vibe\", and in the end, I really appreciate the orginiality of this movie, and I truly think it was an underdated release.\n\nPro's:\nOf course Robin Williams acting in the film, Original plot/story line....\n\nCons:\nWasn't the best quality, sort of low budget.\n\nOverall\nI was very pleased with this release. It's probably cheap enough now that to buy it would be worth it for any true Robin Williams fan, indeed", "label": "4", "processed_sent": "[CLS] For what it is , this movie is great . Very not typical of a Robin Williams film , but that ' s just my opinion . I have seen Robin do so much , from comedy , to this . I was very impressed with his acting . He made the movie and played the character perfectly . Plot This movie is basically about a photo obsessed freak who is lonely and shares his time constrcuting a collage of a frequent customer ' s family at the photo place he works at . After he is found out , the movie really starts to get interesting . \" Cy \" ( Robin williams ) does a [SEP]"}, {"sentence1": "It Could Happen to You was a bit of a disappointment, considering the makeup of the cast: Nicolas Cage, Bridget Fonda, and Rosie Perez among others.\nThe movie brings to the screen the story of a policeman who after winning 4 million dollars on the NY state lotto, decides to share half of it with a waitress he met the previous day.  \nThe acting is surprisingly (!) below average, the dialogues are way below average, while the plot is not bad at all.  \nNicolas Cage's character is too naive and too slow, and that was just sad/pitiful!\nBridget Fonda was unexpectedly plain and bland.\nRosie Perez's character was overly exaggerated to the point that it got tiring AND annoying very early on.\nAs for Wendell Pierce and Stanley Tucci this film does not seem to be their thing; they don't seem to belong.  Subsequently, they are not convincing in their roles at all.\nFinally, somebody shoot the \"Narrator,\" PLEASE!\nThough the potential for a great movie was definitely there it fails to take off.  A shame really...  No masterpiece here.\nIf Nicolas Cage is what you had in mind, check out the AMAZING movies City of Angels and/or The Family Man.", "label": "2", "processed_sent": "[CLS] It Could Happen to You was a bit of a disappointment , considering the makeup of the cast : Nicolas Cage , Bridget Fonda , and Rosie Perez among others . The movie brings to the screen the story of a policeman who after winning 4 million dollars on the NY state lotto , decides to share half of it with a waitress he met the previous day . The acting is surprisingly ( ! ) below average , the dialogues are way below average , while the plot is not bad at all . Nicolas Cage ' s character is too naive and too slow , and that was just sad / pitiful ! Bridget Fonda was unexpectedly [SEP]"}, {"sentence1": "I avoided this movie when it was released because I couldn't imagine that a film based on the marital breakup of Nora Ephron and Carl Bernstein would interest me. Although I am an admirer of both these folks for their talents as writers, I had always agreed with Richard Burton when he said, when asked if he would be writing about his marriage and breakup with Elizabeth Taylor, that even though love might be dead, that it wasn't for sale. Be that as it may, this movie is certainly worth seeing. Although the plot is a little thin, there are some very funny moments. (Whether some of the events actually happened in the Bernstein/Ephron saga doesn't matter.) Any film directed by Mike Nichols, starring Meryl Streep and Jack Nicholson, with cinematography by Nestor Amendros is well worth seeing.\n\nBoth Ms. Ephron and the viewer have the last laugh.", "label": "4", "processed_sent": "[CLS] I avoided this movie when it was released because I couldn ' t imagine that a film based on the marital breakup of Nora Ephron and Carl Bernstein would interest me . Although I am an admirer of both these folks for their talents as writers , I had always agreed with Richard Burton when he said , when asked if he would be writing about his marriage and breakup with Elizabeth Taylor , that even though love might be dead , that it wasn ' t for sale . Be that as it may , this movie is certainly worth seeing . Although the plot is a little thin , there are some very funny moments . ( Whether some of the [SEP]"}, {"sentence1": "I enjoyed each of the Friday series.  I reviewed the original way back, and now after re-watching Next Friday, I thought I'd finally get around to reviewing this.\nI still think I enjoyed Friday the best, but this is a good follow up.  Ice Cube returns as Craig Jones who has a knack for getting into trouble.  He goes to stay with family out in Rancho Cucamonga.  They've just won the lottery and have this whole new place.  While Chris Tucker isn't in here this time, we still get the hilarious John Witherspoon.  He's fantastic.  I only give this four stars because it goes a little flat during the second half, but it's still good overall.  The cousin Day-Day is probably the funniest, but if you are a fan of the original, then you have got to see this.  I loved it", "label": "4", "processed_sent": "[CLS] I enjoyed each of the Friday series . I reviewed the original way back , and now after re - watching Next Friday , I thought I ' d finally get around to reviewing this . I still think I enjoyed Friday the best , but this is a good follow up . Ice Cube returns as Craig Jones who has a knack for getting into trouble . He goes to stay with family out in Rancho Cucamonga . They ' ve just won the lottery and have this whole new place . While Chris Tucker isn ' t in here this time , we still get the hilarious John Witherspoon . He ' s fantastic . [SEP]"}, {"sentence1": "This movie is typical Hollywood anti-war, anti-military, anti-American trash.  The \"show biz\" liberals, aided and abetted by their ideological cousins, the left-wing TV news moguls, have always sought to portray American soldiers in Viet Nam as baby-killing, drug-crazed monsters.  This movie is typical of that ilk. If you want a more balanced view of the men who fought in that terrible war, buy the DVD of \"We Were Soldiers.\"--a much better, and far more honest, film", "label": "2", "processed_sent": "[CLS] This movie is typical Hollywood anti - war , anti - military , anti - American trash . The \" show biz \" liberals , aided and abetted by their ideological cousins , the left - wing TV news moguls , have always sought to portray American soldiers in Viet Nam as baby - killing , drug - crazed monsters . This movie is typical of that ilk . If you want a more balanced view of the men who fought in that terrible war , buy the DVD of \" We Were Soldiers . \" - - a much better , and far more honest , film [SEP]"}, {"sentence1": "Terriffic Movie  just shows how some people make the most of thier lives and tackle the cruelest of diseases with dignity and an inspirational inner stregnt", "label": "5", "processed_sent": "[CLS] Terriffic Movie just shows how some people make the most of thier lives and tackle the cruelest of diseases with dignity and an inspirational inner stregnt [SEP]"}, {"sentence1": "The series is excellent so no problems with the content of the disc. The packaging is interesting but flawed:\nThis is a special edition DVD but it doesn't come in the cardboard sleeves that the rest of the SE series do. The metal container that it does come in has been designed to accomodate all seven DVDs of the series but ONLY if they are removed from their cardboard sleeves! So are we meant to throw the sleeves away or what?! The T-shirt is OK. My Tachikoma ID card was damaged but otherwise no issues", "label": "4", "processed_sent": "[CLS] The series is excellent so no problems with the content of the disc . The packaging is interesting but flawed : This is a special edition DVD but it doesn ' t come in the cardboard sleeves that the rest of the SE series do . The metal container that it does come in has been designed to accomodate all seven DVDs of the series but ONLY if they are removed from their cardboard sleeves ! So are we meant to throw the sleeves away or what ? ! The T - shirt is OK . My Tachikoma ID card was damaged but otherwise no issues [SEP]"}]