[{"sentence1": "This is one of Kellerman's poorest books.  When you FINALLY get to what is going on, it is ridiculous.  Don't waste your time on this", "label": "positive", "processed_sent": "[CLS] This is one of Kellerman ' s poorest books . When you FINALLY get to what is going on , it is ridiculous . Don ' t waste your time on this [SEP]"}, {"sentence1": "I didn't like the only other Dean Koontz book I've ever read, Watchers, but I enjoy reading Kevin Anderson's stuff so I thought I'd give Koontz another try because I'm a reasonable person and I understand that not everyone can like everything by an author.  On to the review:  I realize that this book was initially meant to be a screenplay but I think the authors would have been wise to rewrite it instead of just tweaking it a little when the movie deal fell through.  The dialog is mind-numbing and predictable.  Every time there was a car scene I could guess what kind of conversation would be held.  \"You drive too fast!\"  \"Are you my mother?\"  Over and over and over.  \n\nThe idea was good.  A modern-day Frankenstein . . . or rather a Frankenstein that had never died and had made it to present day (yes, I know, Frankenstein was the doctor, not his monster.  But you get what I'm saying.).  But the dialog read exactly like a movie script would, or like a play.  This book had so much potential but the authors' laziness in not rewriting the entire thing after the movie wasn't made cost it dearly", "label": "positive", "processed_sent": "[CLS] I didn ' t like the only other Dean Koontz book I ' ve ever read , Watchers , but I enjoy reading Kevin Anderson ' s stuff so I thought I ' d give Koontz another try because I ' m a reasonable person and I understand that not everyone can like everything by an author . On to the review : I realize that this book was initially meant to be a screenplay but I think the authors would have been wise to rewrite it instead of just tweaking it a little when the movie deal fell through . The dialog is mind - numbing and predictable . Every time there was a [SEP]"}, {"sentence1": "According to Charles Kimball, religion is the most powerful and pervasive force on earth.  Religion inspires humans to transcend their self-interests, while at the same time, more evil has been committed in the name of religion than any other human institution.  Using a comparative religious approach, Kimball uncovers five warning signs that increase the likelihood of a religion becoming unhealthy or evil.\n\nKimball argues the word `religion' is amorphous and difficult to define.  As a result, the author believes a comparative religious methodology is necessary, one that sees the similarities and interconnectedness of all religions.  Kimball, next, asks if religion is the cause of evil, and he answers both yes and no.  A religion that is arrogant, condescending, and requires adherents to \"disconnect their brain\" is problematic.  On the other hand, religion opens up humanity to a universe of purpose and beauty and teaches how to live meaningful and moral lives as individuals and in community.  Kimball seeks to discover the signs that increase the likelihood of religion becoming evil.  \n\nThe first warning sign that religion is displaying tendencies towards evil is the belief and adherence to absolute truth claims.  When conceptualizations of God are held with certainty and rigid doctrine, the propensity towards evil increases dramatically.   Sacred texts, sources of wisdom and guidance, become abused when selective readings of the text are used to reinforce these absolute truth claims.  Christianity and Islam have missionary mandates, but these become imperialistic when conversion is forced because of absolute truth claims.  Kimball argues for a \"human view of truth\", one that is dynamic and relational, allowing adherents to affirm truth without solidifying truth claims into absolute propositions.\n\nAnother pivotal point when religion becomes evil is blind obedience: when adherents abdicate personal responsibility to religious authorities.  When a charismatic leader demands total obedience, has unrestricted power, and has total control, religion is unhealthy.  Uncritical acceptance of doctrine is also unhealthy, as authentic religion encourages questions and reflection.  Strict segregation from the larger society, combined with a leader with unlimited power is dangerous.  Kimball asserts that religious inquiry and freedom of thought are necessary for responsible religious adherence.\n\nEvery religious tradition believes that something is awry on earth, while some believe that an ideal time will arrive in the future.  When adherents believe they can speak for God and wish to usher in this time, the likelihood for disaster increases.  Many Muslims embrace the hope for an all Islamic society, zealous Jewish settlers dream of a time when Israel will be returned to its divinely promised status, and the Christian Religious Right believe that America should be politically structured with Christian principles in mind.  Kimball opines those who narrowly define temporal structures of the state and those who believe they are God's agents to usher in a theocracy are dangerous.\n\nReligion also becomes a force for evil when the ends justify any means: when one theological component gets elevated, thus becoming an end, and adherents become consumed with achieving or protecting this end.  All religions have notions of sacred space, but an unhealthy religion becomes obsessed with protecting this space.  Reinforcing or protecting group identity against an `other', or protecting group identity from within the group, are also potentially dangerous signs.  Institutional structures develop in all religious traditions, but corruption occurs when the protection of the institution becomes the end.  Kimball asserts that a healthy religion preserves the connection between means and ends.\n\nThe last warning sign occurs when religious leaders believe their struggle is a \"holy\" war.  Kimball outlines the history of pacifism to the just war theory and crusader ideals within Christianity, and he shows how each of these views were represented in the Gulf War of 1990-91.  Islam is a peaceful religion, which asks adherents to build a just and peaceful social order.  The word jihad means \"struggling in the way of God,\" but in a narrower sense jihad is understood as a struggle in a military sense - with rules similar to the Christian just war theory.  Because of socio-economic disparities, some Muslims openly advocate violent means to achieve revolutionary ends, and some leaders declare this revolution as a holy war in order to legitimize their cause.  Kimball believes both that Christian and Muslim adherents should not speak of war but of peace and that the call for holy war is not holy.\n\nWith the knowledge of when religion becomes evil, religions have a clear understanding of healthy praxis.  Faith, hope, and love should be the guiding spiritual compass for all religious adherents, so that in times of conflict unhealthy religious mechanisms can be averted.  Against secularism, Kimball finds validity in religious traditions because of the time-tested wisdom and ethical standards, and he believes that religions should embrace religious diversity.  With religious diversity Christians have three options, exclusivism, inclusivism, and pluralism, but Kimball believes each position has value if adherents from different faiths work together for the common good of humanity. Finally, the Middle East represents a microcosm for the world community: if peaceable solutions are not found in the Arab-Israeli-Palestinian conflict, then the future for the world community and world religions are bleak", "label": "negative", "processed_sent": "[CLS] According to Charles Kimball , religion is the most powerful and pervasive force on earth . Religion inspires humans to transcend their self - interests , while at the same time , more evil has been committed in the name of religion than any other human institution . Using a comparative religious approach , Kimball uncovers five warning signs that increase the likelihood of a religion becoming unhealthy or evil . Kimball argues the word ` religion ' is amorphous and difficult to define . As a result , the author believes a comparative religious methodology is necessary , one that sees the similarities and interconnectedness of all religions . [SEP]"}, {"sentence1": "A remarkable introduction to Ezra Pound.  Makin explains some of the underlying structures that order the Cantos--periplous, ideogram, fugue, the 'repeat in history'--and gives concise readings of individual sections  that helped my understanding enormously.  He does an especially good job of  connecting Pound's theory of money to his views on sex and creativity.   Makin manages to be critical of Pound while treating his ideas with verve  and sympathy;  the writing is colloquial, witty and jargon-free.  I enjoyed  the Cantos much more after reading this short, effective study", "label": "negative", "processed_sent": "[CLS] A remarkable introduction to Ezra Pound . Makin explains some of the underlying structures that order the Cantos - - periplous , ideogram , fugue , the ' repeat in history ' - - and gives concise readings of individual sections that helped my understanding enormously . He does an especially good job of connecting Pound ' s theory of money to his views on sex and creativity . Makin manages to be critical of Pound while treating his ideas with verve and sympathy ; the writing is colloquial , witty and jargon - free . I enjoyed the Cantos much more after reading this short , effective [SEP]"}, {"sentence1": "In 1980 Michael Weiner saw the publication of Weiner's Herbal: The Guide to Herb Medicine, which states the medical benefits of marijuana [7]. However he recently stated that the chemicals in marijuana make it too dangerous to be used as medicine. On his program, he strongly cautions against the recreational use of marijuana, occasionally devoting his show to \"marijuana horror stories\" and its claimed potential to ruin lives. He has authored a number of other books on various herbal medicine topics under this name. More recently, Savage's books are political in nature and published by WND Books, a partnership between the conservative website WorldNetDaily and Thomas Nelson, a publisher of Christian books.\n\nIn January 2003 he published The Savage Nation: Saving America from the Liberal Assault on Our Borders, Language and Culture, his first book under the pseudonym Michael Savage. The book quickly reached the top of the New York Times bestseller list earning Savage, as noted above, a commentary show on MSNBC. The controversial book directs attacks at \"media bias\", the \"dominating culture of 'she-ocracy'\", gays, and liberals.\n\nCritics have faulted Savage for making a number of assertions in the book that he often fails to substantiate with facts or resources. Exacerbating this condition is the fact that the book itself has no index. The book is divided into two- to four-page sections, many of which are near-exact replicas to columns he published on the conservative site NewsMax.com.\n\nIn January 2004, Savage published his second political book, The Enemy Within: Saving America from the Liberal Assault on Our Schools, Faith, and Military. His newest book, Liberalism is a Mental Disorder was released on April 12, 2005. Both of these books contained citations of nearly every assertion made, contrary to \"The Savage Nation.\"\n\nIn January 2006, Savage announced that he would be releasing a new book, The Political Zoo, in mid-March. [8] The book will contain satirical profiles and cartoons of different people in politics as animals in the \"Political Zoo\" including one of Savage himself, who will be portrayed as the zookeeper. Savage has remarked that the book will be \"easier to digest\" than his previous political books.\n\nBooks as Michael Weiner\nPlant a Tree, New York : Collier Books, 1975 \nBugs in Peanut Butter, Boston : Little, Brown, 1976. \nMan's Useful Plants, New York: Macmillan. 1976. \nEarth Medicine, Earth Food, New York : Macmillan Pub. Co., 1980. \nThe way of the skeptical nutritionist, New York : Macmillan, 1981. \nNutrition Against Aging, Bantam books, 1983. \nSecrets of Fijian Medicine, Quantum Books, 1983. \n\"Vital Signs\", Avant Books, 1983 \nGetting Off Cocaine, Avon Books, 1984. \nMaximum Immunity, Boston : Houghton Mifflin, 1986. \nReducing the risk of Alzheimer's, New York : Stein and Day, 1987. \nThe Complete Book of Homeopathy, Garden City Park, N.Y. : Avery Pub., 1989. \nThe Herbal Bible, San Rafael, CA : Quantum Books, 1992. \nHealing children naturally, San Rafael, CA : Quantum Books, 1993. \nHerbs that heal : prescription for herbal healing, Mill Valley, CA : Quantum Books, 1994. \nThe Antioxidant Cookbook, Mill Valley, CA : Quantum Books, 1995. \n[edit]\nBooks as Michael Savage\nThe Savage Nation, WND Books, 2003. \nThe Enemy within, Nelson Current, 2004. \nLiberalism is a Mental Disorder, Nelson Current, 2005. \nThe Political Zoo, Nelson Current, 2006. \n\nMichael Alan Weiner was born to a Russian Jewish family [1] in the borough of The Bronx in New York City. Michael Savage earned a Bachelor's from Queens College in education and sociology. He taught high school for several years in New York City. Following that, he earned two Master's degrees in ethnobotany and anthropology from the University of Hawaii. He then received a Ph.D. in nutritional ethnomedicine in 1978 from the University of California, Berkeley. His thesis was titled Nutritional Ethnomedicine in Fiji. Savage spent many years researching botany in the South Pacific, and has a background in alternative medicine. He has stated he was a liberal at one time and never served in the military.\n\nWeiner was a friend of openly gay beat poet Allen Ginsberg, offering to arrange readings for Ginsberg and Lawrence Ferlinghetti in 1972. [2] Some of his letters to Ginsberg are held in Ginsberg's archives and one of those letters describes an encounter with a young Fijian man. [3] Savage denies writing the letter and called it part of a \"smear campaign\" by \"gay fascists\". [4] Savage also once posed naked for a photograph with Ginsberg while swimming in Fiji. [5] Ferlinghetti views Weiner's reincarnation as Michael Savage as \"total opportunism,\" the crowning achievement of someone who was \"always looking to make a fast buck\" and \"always trying to think up new schemes to get famous.\"\n\nMichael Savage began his radio career in 1992 on San Francisco's #1 news/talk radio station KGO, first doing fill in work for other hosts, then getting his own show on the weekend. Two years later he was given a weekday show on KGO's sister station KSFO where he shared airtime with a liberal talk show host. He chose his \"nom de voix\" in \"the Tonga Islands in the 1960s. I stumbled upon the name of a [19th-century] shipwreck who was locally infamous -Charles Savage. His exploits were legendary,\" he said. \"So the name was bouncing around in my head.\" At the time, his slogan was \"To the right of Rush, and to the left of God.\" On January 1, 1995 he was given his own show during the drive-time hours. The show quickly became a local hit. In 1999, he came to the attention of the Talk Radio Network.\n\nOn January 17, 2000 he started doing an additional two hours of radio which was broadcast nationally. For the next eight months, Savage would spend a total of five hours a day just talking. His national experiment was a success, and on September 21, 2000, he stopped doing separate shows, beginning a full three-hour national show. After just one year, he was in 150 markets. By 2003, he was in over 200 markets and is currently the No. 3 radio host in the United States.\n\nIn June 2003, he had a salary dispute with his flagship station KSFO who refused to renegotiate his contract. He was off the air for three weeks. On July 1, 2003 he began his show on a different station: KNEW in San Francisco. Since that dispute, he speaks badly of KSFO and of \"Vanity or Pretty Boy\" Sean Hannity, whose show replaced his on the station. Savage also speaks pejoratively when referencing his fellow talk radio hosts or individuals with whom he disagrees (see List of Michael Savage neologisms).\n\nAs of 2005, Savage has between 8 million and 10 million listeners per week. This makes his show the third most widely listened to broadcast in the United States.\n\nIn 1996 he applied to be a dean at UC Berkeley's Graduate School of Journalism. When he was not granted an interview due to lack of qualifications--less than two years of experience in radio, with a Ph.D. in epidemiology and nutrition science--Savage filed a discrimination lawsuit that was eventually dismissed. The position instead went to China scholar Orville Schell who, according to Weiner, was less qualified than himself.\n\nSavage was hired by MSNBC to do a one-hour show starting March 8, 2003. On July 7, a mere four months later, he was fired for making anti-gay remarks in response to a caller, later identified as prank caller \"East Coast Bob.\"\n\nSavage was doing an \"Airline Horror Stories\" piece, when Bob called into his show to talk about undercover security guards smoking in the bathroom. His next words were \"Half hour into the flight, I need to suggest that Don and Mike should take your show so you can go to the dentist because your teeth are really bad\". The words after \"should\" were bleeped out by a MSNBC exec, which would make one believe that the caller was actually making lewd comments about Savage's sexual orientation. Savage asked if he was a \"sodomite\", to which the caller answered \"yes\" . Savage then said to the caller: \"Oh, so you're one of those sodomites. You should only get AIDS and die, you pig, how's that? Why don't you see if you can sue me, you pig. You got nothing better to do than to put me down, you piece of garbage, you got nothing better to do today, go eat a sausage and choke on it. Get trichinosis. Now do we have another nice caller here who's busy because he didn't have a nice night in the bathhouse who's angry at me today? Put another, put another sodomite on....no more calls? I don't care about these bums, they mean nothing to me. They're all sausages.\" [6]\n\nBefore the show was canceled, MSNBC was replaying his show during primetime hours Saturday night; many believe the show would have been canceled even without his comments, and that MSNBC was simply looking for an excuse to dump the program due to pressure from special interest groups. Others point out that MSNBC has had poor programming and ratings performance for a long time and that many talk shows of all different political stripes have come and gone quickly on the network.", "label": "positive", "processed_sent": "[CLS] In 1980 Michael Weiner saw the publication of Weiner ' s Herbal : The Guide to Herb Medicine , which states the medical benefits of marijuana [ 7 ] . However he recently stated that the chemicals in marijuana make it too dangerous to be used as medicine . On his program , he strongly cautions against the recreational use of marijuana , occasionally devoting his show to \" marijuana horror stories \" and its claimed potential to ruin lives . He has authored a number of other books on various herbal medicine topics under this name . More recently , Savage ' s books are political in nature and published by WND Books , a partnership between [SEP]"}, {"sentence1": "This book made me feel like I was being patronized. They said the same thing over and over. I wish I hadn't bought it", "label": "positive", "processed_sent": "[CLS] This book made me feel like I was being patronized . They said the same thing over and over . I wish I hadn ' t bought it [SEP]"}, {"sentence1": "Thirty years later and this classic remains a compelling read. This book has fueled a thousand others, setting the perspective for all those interested in the building blocks of life. It's a genes-eye-view of where we came from and how we are motivated, a science and reason-based treatise that is compulsory reading for those of us intent on learning from and about our remarkable natural history. Other books by Dr. Dawkins maybe an easier read but this is where it all started", "label": "negative", "processed_sent": "[CLS] Thirty years later and this classic remains a compelling read . This book has fueled a thousand others , setting the perspective for all those interested in the building blocks of life . It ' s a genes - eye - view of where we came from and how we are motivated , a science and reason - based treatise that is compulsory reading for those of us intent on learning from and about our remarkable natural history . Other books by Dr . Dawkins maybe an easier read but this is where it all started [SEP]"}, {"sentence1": "This is a great book.  I couldn't wait to see what was going to happen  next and how all the mixups would be straightened out! It is a very funny  and delightful book, I hope there will be a sequel, we need to know what  happens to these people, I feel like I know them", "label": "negative", "processed_sent": "[CLS] This is a great book . I couldn ' t wait to see what was going to happen next and how all the mixups would be straightened out ! It is a very funny and delightful book , I hope there will be a sequel , we need to know what happens to these people , I feel like I know them [SEP]"}]