[{"sentence1": "Another solid text from our friend Sensei Demura. This is part of his popular set on Okinawan Weaponry and well worth the cost. Portrayed in the book is weapon history, basic stances, grips, blocks and strikes. Demura also covers self defense applications against many various attacks. For all Karate and Kobudo students I would reccomend this book", "label": "negative", "processed_sent": "[CLS] Another solid text from our friend Sensei Demura . This is part of his popular set on Okinawan Weaponry and well worth the cost . Portrayed in the book is weapon history , basic stances , grips , blocks and strikes . Demura also covers self defense applications against many various attacks . For all Karate and Kobudo students I would reccomend this book [SEP]"}, {"sentence1": "Since I received this book I have been carting it around, using it for reference ever since. I wish that I had been introduced to this book sooner in my college career; it sets a good foundation for the basics. It is also good for sparking ideas if you are stuck. Robin Williams also writes well, making it a fun, easy read (like all her books).\n\nI highly recommend this title", "label": "negative", "processed_sent": "[CLS] Since I received this book I have been carting it around , using it for reference ever since . I wish that I had been introduced to this book sooner in my college career ; it sets a good foundation for the basics . It is also good for sparking ideas if you are stuck . Robin Williams also writes well , making it a fun , easy read ( like all her books ) . I highly recommend this title [SEP]"}, {"sentence1": "The story, Walk Across the Sea, by Susan Fletcher, takes place at a town near the ocean. White people thought themselves superior to others, especially the Chinese. Chinese were often looked down upon and shunned, mainly because of their religious beliefs. The lighthouse keeper's daughter, however, was different from other white people. Believing her father's talks about Chinese people in the beginning of the story, the girl, Eliza Jane, meets a Chinese boy around her age. After the Chinese boy saves her goat, Eliza becomes interested in the boy's behavior. Soon, she learns that everyone may not be as they seemed.\n    This story was rather interesting in a way. The time of the story show how the characters act and think. The story also shows how different some characters are, such as Eliza's father and mother. (\"Something moved inside me, like a sudden shift in the wind.\") Eliza was also, in a way, different from other white people. She befriended and showed kindness toward the Chinese boy. (\"`You'll do him no harm? I have your word on it?'\") I was also amazed by the twist of the story when the story reveals that the father truly worries about the Chinese boy.\n    Of all of the stories I have read, I have never found one that was perfect. This story is no different. When the Chinese people were driven out of the village by angry white people, I could feel the same shock and anger Eliza felt. The story, however, has a few more bad parts. One boy, Amos, accidentally broke Eliza Jane's nose while trying to find the Chinese boy. Afraid that he might get in trouble, the boy lied to his father about breaking Eliza's nose. To make matters worse, Amos blames the fault on the Chinese boy! (\"I had a mind to shout at him, to tell him to put her down...\") On the other hand, I did not like how Eliza acted toward the Chinese boy when they first met. When the boy yelled a warning, Eliza thought he was trying to scare her off so he could steal her goat. Therefore, when the boy was holding the goat, Eliza thought that he was taking the goat from her, when what really happened was that the boy saved the goat from a wave. Even so, that was not the worst part of the story. (\"`Get you from me,' he said. `I can't be near you now. Get out of my sight!'\") As a father, Eliza's father was expected by me to listen and talk to Eliza about her Chinese friend, and maybe even understand why she was protecting him. As a result, I was shocked and disappointed in her father when he told her that he did not even want to talk to her! Thankfully, there was nothing worse than this part of the story.\n    (\"Terrible things can happen in this world-things you can't explain away. It's not safe here, Andrew John. I can't promise you'll be safe. But there are miracles, too-like you. And love. And glories well beyond our knowing.\") The ending, where Eliza talks to her baby brother about life and the Chinese boy was my favorite part. It ties everything together and concludes the story about friendship", "label": "negative", "processed_sent": "[CLS] The story , Walk Across the Sea , by Susan Fletcher , takes place at a town near the ocean . White people thought themselves superior to others , especially the Chinese . Chinese were often looked down upon and shunned , mainly because of their religious beliefs . The lighthouse keeper ' s daughter , however , was different from other white people . Believing her father ' s talks about Chinese people in the beginning of the story , the girl , Eliza Jane , meets a Chinese boy around her age . After the Chinese boy saves her goat , Eliza becomes interested in the boy ' s behavior . Soon , she learns that everyone may not be as [SEP]"}, {"sentence1": "Being an engineer in the aerospace industry I was highly interested in this book based on my experiences from the vantage point a \"hard industry.\" I personally believe that it's in our long term interests to maintain a strong manufacturing base because that's the foundation of real wealth, not legal services or newswires. So this book sounded like the perfect source of information to explain our current economic situation, give an assessment of how bad or how good it really is, and suggest ways to improve it. Oh, how very, very wrong I was . . .  \n\nThis book started off strong, . . . for about four pages. After that a litany of tortured logic, un-sourced assertions, facts taken completely out of context except for the author's subjectively added adjectives, Orwellian double-speak, sleight of hand arguments, flat out ridiculuos statements, contradictory assessments, and even emotional vitriol coalesced not so much into an argument for industry but one for eighteenth century mercantilism with perhaps a sprinkling of far left George Soros on top to serve as an update for the twenty first century. \n\nEven a broken watch is correct twice a day though, so there were some good points in the book which buy it the 2 star rating. These include: \n\n- Manufacturing provides a large source of proprietary knowledge which both improves productivity and serves as a barrier of entry, creating an industry with a large base of high paying jobs, provided it's run right. (A big if.) \n\n- High wage nations can still compete effectively with low wage nations in manufacturing by being capital intensive. \n\n- Americans need to save more and our education system needs to produce more engineers and technically oriented graduates. \n\n- There is some excess in the financial services and managers of publicly traded companies take too short term a view, leading them to sell the company upriver in the long run because of a personal temporary short term gain. (i.e. Enron)  \n\nA scholarly, fair, and comprehensive book that focused on the above would be extremely interesting and useful. This is not what you'll get in this book though. Instead you'll get:\n\nA begining section about postindustrialism, things like the internet, information technology, financial services, etc., the things that make the services based economy. In three chapters the author simply sets up straw men by taking the worst examples of post industrial advocates, instead of presenting a comprehensive picture of the post industrial argument. Not being satisfied with this he proceeds to beat the straw men, set them on fire, and piss on the smoldering remains. This is where vitriol even comes out, where he equates the post-industrialists to people incapable of even thinking. If someone has to go to this extreme to make their argument, they probably don't have one. Most telling he leaves the final assessment of the value of the internet to a feminist. To me, this would be like leaving the final assessment of how good a bicycle is to, oh, I don't know, let's say a fish.\n\nA middle section extolls the virtues of manufacturing. This is a bunch of hand picked anectdotal stories and there's no overview of manufacturing in the world or its real impact on economies at large. This is the kind of subject that screams for reams of data, charts of GDP growth over time, pie charts of the breakdown of economies into services, manufacture, agriculture, etc. You will get none of that. There's little value except in reassuring the obvious, high wage nations CAN do manufacturing. Many of these cherry-picked anectdotal examples still don't quite dove-tail with all his claims about manufacturing though! You also know you're being left in the dark with a plethora of CYA disclaimer statments like \"while Industry_X has certainly had its share of problems recently . . .\" at the begining of a section.   \n\nA final section basically amounts to an attack on laissez-faire, free markets, and the concept of free trade. George Soros and a bunch of other lefties, with Pat Buchanan thrown in for \"balance\", should be listened to instead. \n\nThe worst part of this book is the author's lack of an ability to make any sort of coherent argument. Examples of twisted thinking abound:\n\n- A post-industrial \"industry\" grows five times over in a certain period. The author then goes onto explain how this is not really real growth but something that in reality is bad. Later he proves how great a manufacturing industry is because in the same period it grows a whopping 60%! Self contradictory evaluations of the performance of services vs manufacturing is common and always falls down on the side that the manufacturing industry is far far better than the service industry even when all the standard economic indicators suggest otherwise. The author's challenge to the reader seems to be \"who are you going to believe? Me, or your lying eyes?\" \n\n- He rips into American post industrial industries as being labor intensive and vulnerable to low wage nations because Americans are no smarter or more creative or more anything than laborers around the world. Later he talks about how great German manufacturing is because Germans are so much more diligent than the rest of the world's workers. \n\n- The only facts he presents - and they are surprisingly thin and overwhelmed by mere assertions - are always modified by his subjective opinion and never put in context. When describing service industries \"paltry\" $50 million revenues, \"only\" 60,000 jobs, \"disappointing\" 24% of revenues from foreign sources is common. But when describing manufacturing \"a very high\" $6 million revenues, \"a good mix\" of 1,500 jobs, and similar glowing assessments are inevitable despite the number to follow. A number in and of itself means nothing. The fact the author leaves out any head on, direct comparison between industries is telling. \n\n- Official figures are the ultimate source of information when they agree with what the author believes. When the official figures don't agree with him, he finds some loner who does and then barely explains how this time around the official figures are somehow wrong. When attacking his straw men though, he accuses them of ignoring official figures and quoting some loner.  \n\n- Gems of Orwellian double-speak sentences include examples like \"Solar is already a fully competitive source of energy in remote areas that do not have grid electricity. (pg. 184)\" I.e. it's competitive where there is NO competition! And \"Even in Singapore, one of the freest societies in the East, the savings rate was successfully boosted by a system of forced savings . . . (pg. 229)\" That's not very free if it's FORCED is it? (His defense of solar is one of the most hilariously pathetic eight pages I've ever read and really is worth the price of the book. He capstones it with the \"most encouraging\" observation that solar cells have gone from producing one third of the energy used to make them before they wore out - that is consuming more total energy in their manufacture than they eventually make!- to now producing three times as much energy as required to produce them before they wear out. Wow, what an achievement. Any ACTUAL power source converts many thousands of times the energy used to manufacture it before it's internal workings wear out, but whatever . . .)\n\n- Americans are dumb and the only successful American companies basically blundered into monopolies on standards. The American economy, despite the statistics, is in bad shape. The Japanese instead are eight feet tall, can read people's minds and see through lead. The Japanese economy, despite the statistics, is in really great shape. This type of persistently biased characterization makes you question everything he claims, and eliminates any value or truth he might actually have in his arguments. The author basically can't get out of his own way.  \n\n- He always attacks opponents of his viewpoint by claiming that they don't put numbers into context, are using twisted logic, making mere assertions instead of quoting facts, etc., apparently oblivious that these are the very same tactics he himself uses!\n\n- He claims Boeing is no longer a good company because 30% of components in a Boeing aircraft are now made abroad vs. 2% in the 1960's. This is actually because foreign manufacturing for those components happens to be better and cheaper. America isn't doing that badly in aerospace by the way. The author fails to mention that 50% of the \"European\" Airbus is made in America. This is an example of free trade actually distributing production to where it is most efficient. \n\nThe list goes on and on to ridiculous proportions. You'd have to buy the book to see them all because there's at least one thing an alert and critical reader can find highly questionable on each page. \n\nAll in all, this book was way off the mark and a highly squandered opportunity. It's really a mercantilist argument, and the only common thread that I could see in all the author's cloudy reasoning is that nation's should do everything in their power to export more than they import no matter what. It's NOT, unfortunately, a book about how to revitalize American manufacturing in a globalized world.", "label": "positive", "processed_sent": "[CLS] Being an engineer in the aerospace industry I was highly interested in this book based on my experiences from the vantage point a \" hard industry . \" I personally believe that it ' s in our long term interests to maintain a strong manufacturing base because that ' s the foundation of real wealth , not legal services or newswires . So this book sounded like the perfect source of information to explain our current economic situation , give an assessment of how bad or how good it really is , and suggest ways to improve it . Oh , how very , very wrong I was . . . This book started off strong , . . . for about four [SEP]"}, {"sentence1": "This book covers all the elements of Game Theory, emphasizing intuition over mathematical formalism.  The philosophical aspects are also given a thorough  treatment.    The 8 appendices provide a more formal exposition  of several key concepts such as the Minmax Theorem, the geometry of  equilibria and Linear programming.  The book has not changed much since its  publication in 1957, but it is by no means  archaic.      Even for those  who have a modern and more rigorous textbook,  &quot;Games and  Decisions&quot; is  Highly recommended  as a supplement. There is something  for everyone in it", "label": "negative", "processed_sent": "[CLS] This book covers all the elements of Game Theory , emphasizing intuition over mathematical formalism . The philosophical aspects are also given a thorough treatment . The 8 appendices provide a more formal exposition of several key concepts such as the Minmax Theorem , the geometry of equilibria and Linear programming . The book has not changed much since its publication in 1957 , but it is by no means archaic . Even for those who have a modern and more rigorous textbook , & quot ; Games and Decisions & quot ; is Highly recommended as a supplement . There is something for everyone in it [SEP]"}, {"sentence1": "Today, I heard Sister Prejean speak about her book Dead Man Walking and about all of the experiances that shes been through concerning the death penalty.  Nothing less than amazing.  Dead Man Walking calls upon the unjustices in the death penalty but also on the actual death penalty victims.  Many people think that death penalty victims are just plain bad people.  Read this book.  If you want to be challenged on your views, read this book.  You can't be idle on the death penalty.  Also, coming soon is the Death of Innocence.  Sister Prejean spoke on the content of this book and the stories within it.  Once again, nothing less than amazing.  A story that is priceless to hear and will influence your life", "label": "negative", "processed_sent": "[CLS] Today , I heard Sister Prejean speak about her book Dead Man Walking and about all of the experiances that shes been through concerning the death penalty . Nothing less than amazing . Dead Man Walking calls upon the unjustices in the death penalty but also on the actual death penalty victims . Many people think that death penalty victims are just plain bad people . Read this book . If you want to be challenged on your views , read this book . You can ' t be idle on the death penalty . Also , coming soon is the Death of Innocence . Sister Prejean spoke on the content of this [SEP]"}, {"sentence1": "The only redeeming points of this book are the few conversations that the author has with his uncle. The rest is just quotations from other books. There is enough original material here for about a chapter and a half. The author was set on making a book out of it so he just padded it with things that other authors had said. \n\nI read it to the end though. Probably because the author has a very nice writing style. He is probably a good playwrite though I have never read any of his plays. He just didn't have enough material for a book here. I'm surpised it got published", "label": "positive", "processed_sent": "[CLS] The only redeeming points of this book are the few conversations that the author has with his uncle . The rest is just quotations from other books . There is enough original material here for about a chapter and a half . The author was set on making a book out of it so he just padded it with things that other authors had said . I read it to the end though . Probably because the author has a very nice writing style . He is probably a good playwrite though I have never read any of his plays . He just didn ' t have enough material for a book here . I ' m surpised it [SEP]"}, {"sentence1": "I am a GIGANTIC James Brown fan, I have 100 albums, 130 singles, I've met him 5 times, seen him live over 100 times since 1971, had lunch with him in NYC, and I am the 'Paul' in the JB section of Gerri Hirshey's nice history of soul music NOWHERE TO RUN, but if this book was written by James Brown or if he even had much to tell the writer, I'll eat my refrigerator. It is so full of errors that it is laughable. One of the most glaring errors was when Mr. Brown 'supposedly' said, \"SAY IT LOUD was where funk started\" or something to that effect. That is so ridiculous. James Brown would NEVER say such a thing! Any student of funk knows that COLD SWEAT was the quintessentional funk piece and it is not even mentioned in the book!!! The style of Mr. Brown's sentences that are attributed to him sound NOTHING like him. I have no idea why this was put out. The other 'autobiography' written over a decade ago was more relevent and much better written, THE GODFATHER OF SOUL by JB and Bruce Tucker. Someone, (Alan Leeds?) needs to write a 600 page comprehensive biography of Mr. Brown with much more detail.", "label": "positive", "processed_sent": "[CLS] I am a GIGANTIC James Brown fan , I have 100 albums , 130 singles , I ' ve met him 5 times , seen him live over 100 times since 1971 , had lunch with him in NYC , and I am the ' Paul ' in the JB section of Gerri Hirshey ' s nice history of soul music NOWHERE TO RUN , but if this book was written by James Brown or if he even had much to tell the writer , I ' ll eat my refrigerator . It is so full of errors that it is laughable . One of the most glaring errors was when [SEP]"}, {"sentence1": "I enjoyed this book immensely.  \n\nRemember, the subtitle is \"MY friendship with JFK, Jr.\", the book is about the author and HIS friendship with John.  It's not meant to be a historical view of JFK and his presidency.\n\nWhy is it OK for Carole Radiwill to write a book about her relationship with JFK, Jr. and Carolyn but not OK for Billy Noonan? Because he wasn't on Oprah.\n\nLighten up.", "label": "negative", "processed_sent": "[CLS] I enjoyed this book immensely . Remember , the subtitle is \" MY friendship with JFK , Jr . \" , the book is about the author and HIS friendship with John . It ' s not meant to be a historical view of JFK and his presidency . Why is it OK for Carole Radiwill to write a book about her relationship with JFK , Jr . and Carolyn but not OK for Billy Noonan ? Because he wasn ' t on Oprah . Lighten up . [SEP]"}, {"sentence1": "I thought this book would be great and was really looking forward to making some of the recipes, but I have to admit I'm disappointed with the recipes and with what I've baked from it so far.  I was surprised that so many of the recipes called for vegetable shortening instead of or in addition to butter.  I know the book itself explains that shortening is used to achieve a certain texture, but I have read in other baking books that shortening is a crutch and doesn't deliver the flavor punch of pure butter.\n\nSo I was a little skeptical, and then reading through the recipes, although they are very clearly written, there aren't a lot of extra tips on technique or anything for individual recipes.  The book already assumes a level of competence.\n\nI made three recipes from the book: the essential chewy sugar cookie, the essential chewy chocolate chip cookie, and the Fudgy Brownies.  All three recipes tasted delicious, so I can't complain there, but the brownies came out a little tough for my tastes, and both the cookies spread too much -- way too much, and I even refrigerated the dough for the sugar cookies. I consider myself to be an intermediate baker and have made these cookies from other recipes in the past with better results, so right now I'm wondering if I should even try any more of the recipes in this book or just give up.  I think it's okay for a \"base\" cookie recipe book, but you would need to look elsewhere for better techniques or to tweak the ingredients", "label": "positive", "processed_sent": "[CLS] I thought this book would be great and was really looking forward to making some of the recipes , but I have to admit I ' m disappointed with the recipes and with what I ' ve baked from it so far . I was surprised that so many of the recipes called for vegetable shortening instead of or in addition to butter . I know the book itself explains that shortening is used to achieve a certain texture , but I have read in other baking books that shortening is a crutch and doesn ' t deliver the flavor punch of pure butter . So I was a little skeptical , and then reading through the recipes , although they [SEP]"}, {"sentence1": "I started reading this immediately after the last REH compilation and there could not be a greater difference in story telling. While REH was first and foremost a story teller, Pressfield uses one of the absolute worst devices in his recount of a grandson of his grandfather's remembering his conversations with a client who knew the famous Alcibiades. This, as previous reviewers have mentioned, creates a large gap between reader and story. But why do this? Why use such a crappy method of story telling? I guess it pads the book with unnecessary dialogue. All in all, it's a slow, uninspired, day dream story. So crappy that I felt it necessary to write this review echoing previous harsh reviews.\n\nI want my money back", "label": "positive", "processed_sent": "[CLS] I started reading this immediately after the last REH compilation and there could not be a greater difference in story telling . While REH was first and foremost a story teller , Pressfield uses one of the absolute worst devices in his recount of a grandson of his grandfather ' s remembering his conversations with a client who knew the famous Alcibiades . This , as previous reviewers have mentioned , creates a large gap between reader and story . But why do this ? Why use such a crappy method of story telling ? I guess it pads the book with unnecessary dialogue . All in all , it ' s a slow [SEP]"}, {"sentence1": "This is a great beginner's guide to home buying.  The advice is straightforward and the explanations are easy to understand. \n\nBuying a home is a scary and daunting prospect for me.  I kept getting a lot of conflicting advice from relatives, friends, and coworkers on when to buy, what to buy, and how to buy.  This is very frustrating as everyone means well, but what worked for them might not apply to me. And don't bother asking a realtor or mortgage company if you should buy--they make their living on our decisions to buy! \n\nSo I bought Home Buying for Dummies to learn more, and it has a lot of sound and thoughtful guidance to help decide when and how much to buy...  And also how to find a good home, and then negotiate with the realtors, the sellers, the mortgage companies, and everyone else that is sticking their hands in your wallet.  \n\nThe author's advice is realistic, and he points out the pitfalls of jumping in and what trouble you can get into with the different loan options out there", "label": "negative", "processed_sent": "[CLS] This is a great beginner ' s guide to home buying . The advice is straightforward and the explanations are easy to understand . Buying a home is a scary and daunting prospect for me . I kept getting a lot of conflicting advice from relatives , friends , and coworkers on when to buy , what to buy , and how to buy . This is very frustrating as everyone means well , but what worked for them might not apply to me . And don ' t bother asking a realtor or mortgage company if you should buy - - they make their living on our decisions to buy ! So I bought Home Buying [SEP]"}, {"sentence1": "I started reading this book hoping for the best.  In turn, I found that my hopes weren't fulfilled.  The beginning half was intriguing and kept me wanting more.  After the tone changed, the book became bitter and boring.  The characters lost their flare, and the whole book lost personality.  The book became dull and lost appeal to me.  The book's writing style, in the beginning, was original and fun.  Following the death of Little Red the book slowly fell apart, leaving me tempted to stop reading the book. If someone asked me to recommend a good book, this would not be the one", "label": "positive", "processed_sent": "[CLS] I started reading this book hoping for the best . In turn , I found that my hopes weren ' t fulfilled . The beginning half was intriguing and kept me wanting more . After the tone changed , the book became bitter and boring . The characters lost their flare , and the whole book lost personality . The book became dull and lost appeal to me . The book ' s writing style , in the beginning , was original and fun . Following the death of Little Red the book slowly fell apart , leaving me tempted to stop reading the book . If someone asked me to recommend a good book , this would not be the one [SEP]"}, {"sentence1": "I was eager to read this book, but after reading it I was left completely flat.  The rest of the iceberg?  Hardly.\n\nSmith barely gives us more than what we could get from reading Sports Illustrated, or any Minnesota sports page.  He admits he's not a fan of football, but for the majority of the book leisurely describes the most basic parts of his football career.  \n\nThis book is touted as: his full and complete story.  So we learned he was watching Ren & Stimpy during his NFL Draft.  Wow, are these the types of meaty stories that we want to read?\n\nHow about telling us more of the inside details...  How did Smith deal with people who wanted to be his friends or girlfriends only because he was a star football player?  Who were his friends that he could trust, and when did he need that trust?  What thoughts enter your mind as you look to hire an agent?  What was he doing when he was \"goofing off and missing class all summer\" which led to one of the most covered stories of his time at Ohio State?  When, and why did he begin using pot?  If football is not \"smart\" enough for him, why doesn't he study and break down some of the coaching process that is more mentally challenging?  What happened to plans for medical school?  We know the stories of football; those are the parts of the iceberg that have already been documented.\n\nI also felt Smith wrote this book as if he is defending himself from all of America.  Who is attacking him?  Why does he feel the need to explain why he was paid so much?  Highly paid athlete stories are, sorry for the pun, a dime a dozen.  He tries to compare his sitting out for more money to a scenario for the average guy.  The truth is, many people will take a job for 5% less than a co-worker because yes, they value things other than money, and yes, they are happy to have a job.  \n\nLeaving the grammatical errors to the other reviewers, it felt like I was reading an average high school creative writing project.  'I did this, I did that, I went to bed, next day.'  Half of his quotes are from the wellspring of deep philosophy: pop music.  Smith notes \"less than 50 percent of Americans read at a 10th-grade level\".  Well, this book certainly won't tax the reading ability of too many people.\n\nOne lesson from this book is that Smith had opportunities to swallow his pride, take some coaching, and come up with a better solution.  This book is another one of those times.  He should have hired an editor or writing consultant who could give guidance.  Build the characters; help us feel their stories.  Instead, Smith felt it necessary to go alone to get to the raw emotions.  Sorry, but compared to other autobiographies, this was not an emotional book.\n\nI'm sure Smith is all the things that Mike Gutter says he is, such as: thoughtful, honest, trustworthy, dependable, passionate...  but I felt that some of the best stories that would demonstrate these characteristics were left out of this book.  \n\nInstead, we are still looking for the rest of the iceberg.", "label": "positive", "processed_sent": "[CLS] I was eager to read this book , but after reading it I was left completely flat . The rest of the iceberg ? Hardly . Smith barely gives us more than what we could get from reading Sports Illustrated , or any Minnesota sports page . He admits he ' s not a fan of football , but for the majority of the book leisurely describes the most basic parts of his football career . This book is touted as : his full and complete story . So we learned he was watching Ren & Stimpy during his NFL Draft . Wow , are these the types of meaty stories that we want to read ? How about [SEP]"}, {"sentence1": "I bought this book for my CCNP recertification.  I ran into a bunch of stuff on the exam that was not covered in this book or was in greater detail than was covered by this book. I used Sybex books before on my original CCNP certification and I passed.  If I try to recertify, it won't be with one of those books.  I'll use Cisco Press.  Live and learn.", "label": "positive", "processed_sent": "[CLS] I bought this book for my CCNP recertification . I ran into a bunch of stuff on the exam that was not covered in this book or was in greater detail than was covered by this book . I used Sybex books before on my original CCNP certification and I passed . If I try to recertify , it won ' t be with one of those books . I ' ll use Cisco Press . Live and learn . [SEP]"}, {"sentence1": "Tony Nourmand's &quot;Film posters of the 60's&quot; is a wonderful and  colorful coffee table style book that is a great treat to look through.  There are many of the classic film poster images of the French New wave,  the films of Stanley Kubrick and the classic 007 posters, just to name a  few. Film poster collecting is a great adventure and this book reflects  that enthusiasm. This book was lovingly organized with great detail. A  superb value! Looking forward to future editions", "label": "negative", "processed_sent": "[CLS] Tony Nourmand ' s & quot ; Film posters of the 60 ' s & quot ; is a wonderful and colorful coffee table style book that is a great treat to look through . There are many of the classic film poster images of the French New wave , the films of Stanley Kubrick and the classic 007 posters , just to name a few . Film poster collecting is a great adventure and this book reflects that enthusiasm . This book was lovingly organized with great detail . A superb value ! Looking forward to future editions [SEP]"}, {"sentence1": "I have used this book for more than 5 years and take it with me on every trip to Paris. If you can't get success from these recipes then you might consider some other past time than baking. Get used to baking with weights and this book is perfect. Something as simple as a Madeleinne is created perfectly in weight measures but just a shot in the dark when using volume measurments. This book is not exactly for beginner bakers but if you have some experience it is fantasti", "label": "negative", "processed_sent": "[CLS] I have used this book for more than 5 years and take it with me on every trip to Paris . If you can ' t get success from these recipes then you might consider some other past time than baking . Get used to baking with weights and this book is perfect . Something as simple as a Madeleinne is created perfectly in weight measures but just a shot in the dark when using volume measurments . This book is not exactly for beginner bakers but if you have some experience it is fantasti [SEP]"}, {"sentence1": "I had never read a Danielle Steel book before, and decided to give her a try, given that she is so popular and has so many books published. I was pretty disappointed. I agree with the other reviewers that the plot is unrealistic; however, if a book is unrealistic but well-written and engaging, I would still like it. I think the biggest problem with this book is the author's excessive repetitiveness. Yes, I get that this character is really cold and unloving---that was already covered 50 pages ago! In addition, character traits could have been better conveyed through situations, rather than simply stating, \"so and so was a devoted mother\" and repeating this fact again and again and again. These flaws in the author's writing kept me skipping through whole sections of the book. This book did not leave me wanting to read more of Ms. Steel's books. It is an ok book if you like romance and very easy, repetitive reading.", "label": "positive", "processed_sent": "[CLS] I had never read a Danielle Steel book before , and decided to give her a try , given that she is so popular and has so many books published . I was pretty disappointed . I agree with the other reviewers that the plot is unrealistic ; however , if a book is unrealistic but well - written and engaging , I would still like it . I think the biggest problem with this book is the author ' s excessive repetitiveness . Yes , I get that this character is really cold and unloving - - - that was already covered 50 pages ago ! In addition , character traits could have been better conveyed through situations [SEP]"}, {"sentence1": "Did we need a Gore Vidal reader? The author is something of a long-winded blowhard, commenting at length (and I mean LENGTH) on every topic imaginable. In that respect he is America's Voltaire, creating reams of comment and interpretation on politics, the arts, and religion and morals. It's hard to say where Vidal fits in the framework of 20th century criticism, as he is not a conventional leftist. Because of his iconoclasm, this collection can only inform the reader about Gore Vidal, not his times nor any intellectual or political movement. All that said, Vidal is a great essayist and a droll wit. This book is much too much for the casual reader -- stick to one of his many shorter collections instead -- but for a Vidal fan (or, say, a reader of &quot;The Nation&quot;) this book is worth the time commitment", "label": "negative", "processed_sent": "[CLS] Did we need a Gore Vidal reader ? The author is something of a long - winded blowhard , commenting at length ( and I mean LENGTH ) on every topic imaginable . In that respect he is America ' s Voltaire , creating reams of comment and interpretation on politics , the arts , and religion and morals . It ' s hard to say where Vidal fits in the framework of 20th century criticism , as he is not a conventional leftist . Because of his iconoclasm , this collection can only inform the reader about Gore Vidal , not his times nor any intellectual or [SEP]"}, {"sentence1": "The humor is definitely not in the book - reviews and summaries use the word \"hilarity\" however, I did not come across any situation that I would classify as even funny,  not to mention hilarious.  I thoroughly enjoyed her first novel, Pink Slip, however, this one seemed depressing.  The two main characters appeared to have no respect or show any outward love toward each other until the very end of the story.  The plot seemed to be very SLOW - the whole story took place in a matter of days, but really, nothing took place in the book.  All in all, they bought a house.  I would pass on this for better reads elsewhere", "label": "positive", "processed_sent": "[CLS] The humor is definitely not in the book - reviews and summaries use the word \" hilarity \" however , I did not come across any situation that I would classify as even funny , not to mention hilarious . I thoroughly enjoyed her first novel , Pink Slip , however , this one seemed depressing . The two main characters appeared to have no respect or show any outward love toward each other until the very end of the story . The plot seemed to be very SLOW - the whole story took place in a matter of days , but really , nothing took place in the book . All in all , they [SEP]"}, {"sentence1": "I was so upset after I finished reading this book.  I wish it wasn't updated and they just kept it in its original version.  If you are looking for a historical information of how the samurai lived and their values, this is the wrong book.  Read Bushido: The Soul of Japan.  The Code of The Samurai really felt like The Code of the Japanese Business Man", "label": "positive", "processed_sent": "[CLS] I was so upset after I finished reading this book . I wish it wasn ' t updated and they just kept it in its original version . If you are looking for a historical information of how the samurai lived and their values , this is the wrong book . Read Bushido : The Soul of Japan . The Code of The Samurai really felt like The Code of the Japanese Business Man [SEP]"}, {"sentence1": "I liked the book but you also have to consider the end killer... Is that logical at all?? The senator is in his late fifties and so how old is his father? If he had the senator when he was twenty he'd have to be 77. Is it really reasonable that he's running around killing people, and setting houses on fire. It was a very unlikely twist to the end. It still was a good book", "label": "negative", "processed_sent": "[CLS] I liked the book but you also have to consider the end killer . . . Is that logical at all ? ? The senator is in his late fifties and so how old is his father ? If he had the senator when he was twenty he ' d have to be 77 . Is it really reasonable that he ' s running around killing people , and setting houses on fire . It was a very unlikely twist to the end . It still was a good book [SEP]"}, {"sentence1": "I have always been a prolific reader and rarely do I come across a book for which I can find no value, no redeeming qualities. But I must extend a hearty congratulations to Julia Barrett for writing the most astounding piece of horse excrement I have ever had the misfourtune to purchace. Teachiing my cat to walk repeatedly over my keyboard would produce a work of more sense. If you are like me and just have to read it - just because you're obsessed with Austen - Buy it used for 45 cents and then burn it", "label": "positive", "processed_sent": "[CLS] I have always been a prolific reader and rarely do I come across a book for which I can find no value , no redeeming qualities . But I must extend a hearty congratulations to Julia Barrett for writing the most astounding piece of horse excrement I have ever had the misfourtune to purchace . Teachiing my cat to walk repeatedly over my keyboard would produce a work of more sense . If you are like me and just have to read it - just because you ' re obsessed with Austen - Buy it used for 45 cents and then burn it [SEP]"}, {"sentence1": "F this self-help industry crap. Quasi-astrological poppycock at its worst. I can tell this book clamps on to the mind and squeezes it to death merely by reading the cliched title. Humans are far more complex than the hack Man-Warrior/Female-Maiden title what's-his-name gives them. And remember, this \"doctor,\" is quietly making mucho mucho bucks off your poor purchase. Your goddamned ancestors never needed a book to run their lives, so why do you? Let's push all the life coaches off cliffs and put the self-help industry to the torch. That's a great start to a sane life", "label": "positive", "processed_sent": "[CLS] F this self - help industry crap . Quasi - astrological poppycock at its worst . I can tell this book clamps on to the mind and squeezes it to death merely by reading the cliched title . Humans are far more complex than the hack Man - Warrior / Female - Maiden title what ' s - his - name gives them . And remember , this \" doctor , \" is quietly making mucho mucho bucks off your poor purchase . Your goddamned ancestors never needed a book to run their lives , so why do you ? Let ' s push all the life coaches off cliffs and [SEP]"}, {"sentence1": "I had to read this book for a political theory class in college.  After talking with several other members I was happy to find out that I do not have the reading skills of a third grader...Benhabib goes out of her way to use vocabulary words that most educated people are not familiar with.  The book is also not organized well.  In order to really understand this book you will have to read it while taking notes.  Points that could be grouped together for arguments are scattered throughout entire chapters and even the whole book.  Benhabib may have used her vocabulary and lack of organization as tools to hide that the points she makes are not very well argued.  Throughout much of the book Benhabib is trying to shoot down the theories of John Rawls and other theorists to support her views on migratory rights.  To be honest, I disagree with her views and admit that I might have found her organization and vocabulary more tolerable if I agreed with her.  Still, I do not have a problem with her making these claims if she did so logically.  Much of her work is based on telling the reader why other people are wrong and she will use theories she supposedly already disproved in one arguement to justify her later arguments for disagreeing with other theories.  \n\nIn short, I do not think anyone would want to read this book for pleasure, or intellectual curiosity.  If you have to read The Rights of Others for a class, I extend my condolences.", "label": "positive", "processed_sent": "[CLS] I had to read this book for a political theory class in college . After talking with several other members I was happy to find out that I do not have the reading skills of a third grader . . . Benhabib goes out of her way to use vocabulary words that most educated people are not familiar with . The book is also not organized well . In order to really understand this book you will have to read it while taking notes . Points that could be grouped together for arguments are scattered throughout entire chapters and even the whole book . Benhabib may have used her vocabulary and lack of organization as tools to hide that the points [SEP]"}, {"sentence1": "Other reviewers have taken pains to outline the \"plot\" of this baby boomer bodice ripper. Suffice it to say author Kathryn Harrison, scrupulously adhering to some private conviction that \"more is better\" , offers estrangement between identical twins, loss of a child, incest, paternity confusion, mid-life crisis and spiteful erotomania as it crops up in the life of one understandably confused New York shrink. This reader was aching for the hero, Will, to book himself onto Jerry Springer while feeling immensely shortchanged by lines from Ms Harrison like \"It's just...it's...What is it? Will doesn't have a word for what he feels.\" (Perhaps the character lacks the emotional vocabulary to communicate with the reader: the author, however, should not. In any case, those are lousy, lazy sentences among so many examples.)\nIn addition to being insufferably, cartoonishly silly, the book is wounded by a dreary internal structure. Bad things happen to Will-the-shrink, Will then regurgitates them at length to HIS shrink, then buttonholes his wife to regurgitate what happened, what he thinks happened, and what he thinks about what his shrink thinks. \nAs for Ms Harrsion's \"famous\" sex scenes. They practically lie on their backs, fondling their adverbs and panting for Penthouse approval: \"She's unbelievably wet and tight and impossibly, almost unnaturally, slippery.\"\n\"Envy\", by the way, is Ms Harrison's 11th book and she should, by now, be getting things more right than wrong", "label": "positive", "processed_sent": "[CLS] Other reviewers have taken pains to outline the \" plot \" of this baby boomer bodice ripper . Suffice it to say author Kathryn Harrison , scrupulously adhering to some private conviction that \" more is better \" , offers estrangement between identical twins , loss of a child , incest , paternity confusion , mid - life crisis and spiteful erotomania as it crops up in the life of one understandably confused New York shrink . This reader was aching for the hero , Will , to book himself onto Jerry Springer while feeling immensely shortchanged by lines from Ms Harrison like [SEP]"}, {"sentence1": "Piglia muestra que es un explorador de nuevas formas narrativas, pero la lectura de este libro y de otros suyos nos deja ver a un autor que no se deja leer con facilidad, que es crptico; debe ser leido con mucha atencin, con papel y lapiz en la mano para seguir sus tramas y personajes y eso no  es un virtud en un escritor", "label": "negative", "processed_sent": "[CLS] Piglia muestra que es un explorador de nuevas formas narrativas , pero la lectura de este libro y de otros suyos nos deja ver a un autor que no se deja leer con facilidad , que es crptico ; debe ser leido con mucha atencin , con papel y lapiz en la mano para seguir sus tramas y personajes y eso no es un virtud en un escritor [SEP]"}, {"sentence1": "When I was 21 and in my first year of graduate school, Paul Fussell's &quot;Poetic Meter and Poetic Form&quot; was one of the first text books assigned to me. When I bought the book and saw how slim it was, I snickered, &quot;Grad school's gonna be a walk in the park!&quot; \n \n Yeah, RIGHT! \n \n This densely packed tome is not for the uninitiated and definitely not absorbed in just one reading. On and off, over the last 20 years, I have come back to this book to refresh my memory and, usually, to astonish myself. The book's real strength, besides Professor Fussell's obvious command of his subject, and his ability to convey that command, is in the sprinkling of dozens of anecdotes by and about poets about other poets and poetry. Even at this late date in my life, I can't pretend to understand the entire book but what I do understand I admire and respect. &quot;Poetic Meter and Poetic Form&quot; is not recommended to anyone studying poetry; it is urgently required", "label": "negative", "processed_sent": "[CLS] When I was 21 and in my first year of graduate school , Paul Fussell ' s & quot ; Poetic Meter and Poetic Form & quot ; was one of the first text books assigned to me . When I bought the book and saw how slim it was , I snickered , & quot ; Grad school ' s gonna be a walk in the park ! & quot ; Yeah , RIGHT ! This densely packed tome is not for the uninitiated and definitely not absorbed in just one reading . On and off , over the last 20 years , [SEP]"}, {"sentence1": "I'm amazed that people didn't like this book more... I am also a Land Arch student who had it as an assigned book that was rarely actually assigned.  I was thumbing through it in hopes of generating ideas for another class and was amazed at the amount of usable information it contained.  Perhaps it is better digested in chunks instead of the whole.  I found it great as a reference book", "label": "negative", "processed_sent": "[CLS] I ' m amazed that people didn ' t like this book more . . . I am also a Land Arch student who had it as an assigned book that was rarely actually assigned . I was thumbing through it in hopes of generating ideas for another class and was amazed at the amount of usable information it contained . Perhaps it is better digested in chunks instead of the whole . I found it great as a reference book [SEP]"}, {"sentence1": "I must agree witht he reviewer who commented about the book being written by committee.   The narrative is choppy and lacking not only key details, but also historical background.   Because it's an autobiography, I don't necessarily think that it's fair to damn the book for being self-centered; it IS about him.   I do feel, however, that the book needs better editing and a bit more self-examination.   \nIt's an okay addition to one's list of books about Everest expeditions - which I must admit, I've developed a morbid fascination with after recently re-reading \"Into Thin Air\".   I wouldn't, however, use it as my primary source for information or impressions", "label": "positive", "processed_sent": "[CLS] I must agree witht he reviewer who commented about the book being written by committee . The narrative is choppy and lacking not only key details , but also historical background . Because it ' s an autobiography , I don ' t necessarily think that it ' s fair to damn the book for being self - centered ; it IS about him . I do feel , however , that the book needs better editing and a bit more self - examination . It ' s an okay addition to one ' s list of books about Everest expeditions - which I must admit , I ' ve developed a morbid fascination with after recently re - reading \" Into [SEP]"}, {"sentence1": "I've just returned from a reading of this book by my philosophy professor, Dr. Luke Barber.  Although he only read from a couple chapters, it was easy to figure out that this book is definitely a must have for anyone who loves  life (or would like to learn how).  Containing good, useful (not to mention  funny) stories, you will be able to relate to the text easily and  effectively!  I plan on purchasing this book and I would definitely  recommend it to anyone interested (and even those that are not!)", "label": "negative", "processed_sent": "[CLS] I ' ve just returned from a reading of this book by my philosophy professor , Dr . Luke Barber . Although he only read from a couple chapters , it was easy to figure out that this book is definitely a must have for anyone who loves life ( or would like to learn how ) . Containing good , useful ( not to mention funny ) stories , you will be able to relate to the text easily and effectively ! I plan on purchasing this book and I would definitely recommend it to anyone interested ( and even those that are not ! ) [SEP]"}, {"sentence1": "It took cancer to wake me up.  I now do everything I can to inform my family and friends of the of the importance of a health lifestyle and eating habits.  This author also wrote \"What you don't know may be killing you\"  These two books are great to accidently leave at a loved ones home.  They are filled with tons of improtant messages and very easy to relate to examples are given that help you understand what actually is happening to your body. My dad has gone from drinking no water to probably half of what he needs but this is a start, he will read more the next time I leave another book by accident...  This author is great!", "label": "negative", "processed_sent": "[CLS] It took cancer to wake me up . I now do everything I can to inform my family and friends of the of the importance of a health lifestyle and eating habits . This author also wrote \" What you don ' t know may be killing you \" These two books are great to accidently leave at a loved ones home . They are filled with tons of improtant messages and very easy to relate to examples are given that help you understand what actually is happening to your body . My dad has gone from drinking no water to probably half of what he needs but this is a start , he will read more the next time I leave another [SEP]"}]